{"original_topic": "adolescence", "comment": "I've been feeling insecure lately. Do you think this hairstyle suits me? THE HAIRSTYLE IS FOR AN EVENT", "timestamp": 1763758906, "label": "1"}
{"original_topic": "adolescence", "comment": "Need advice about a boy at my school Hi,\n\nI’m a 14-year-old girl, and I’m new at my school. For a while now, I’ve noticed that a boy in my class behaves in a certain way towards me, and I’m not sure how to interpret it. Here are the facts:\n\n1. **At the beginning of the school year**, he often tried to make eye contact with me. I’m very shy, so I avoided it. Then, he started calling me *Baka* (a Japanese word for \"idiot\") discreetly, but I could clearly hear him.\n2. **As time went on, his behavior changed**. During a school trip, on the bus, he suddenly said: *\"Wesh \\[my name\\], how are you!?\"* Then, he kept looking at me. Every time I looked at him, he would look away, and when I turned back to the window, he would look at me again. This went on for a while until I got too embarrassed and turned completely away.\n3. **One day in class**, I was talking to his little sister (we’ve become friends) a bit away from the group. When we decided to rejoin the others, he suddenly rushed towards my friend, stopped abruptly when he saw me, and then went back to his friends.\n4. **His little sister told me things about him**. She said he talked about me at home, saying that at the beginning of the year, he had certain thoughts about me, but now it’s better. He also said that I was nice and that I didn’t talk to boys, which made me a \"good Muslim.\" He asked her not to tell me, but of course, she did.\n5. **One day, he asked if I was Moroccan**. I replied a bit curtly (I regret it). My friend later told me that before I arrived, he was talking to his friend about wanting to focus on his projects, but as soon as I walked in, he asked me that question.\n6. **Recently, while I was handing out papers in class**, he suddenly turned towards me and whispered something to his friend.\n7. **Another time, he asked me:** *\"Are you going to defend me at the class council?\"* (I’m just an eco-delegate and not involved in the class council). Right after asking, he left without waiting for an answer.\n\nI’m confused. He seems comfortable talking to other girls, but with me, he acts distant and ambiguous. Do you think he might be interested in me, or am I reading too much into this? How should I react?\n\nThank you in advance for your advice!\n\nAsk me questions if some points are not clear :)", "timestamp": 1763758907, "label": "0"}
{"original_topic": "adolescence", "comment": "The Growing Child: Adolescent 13 to 18 Years", "timestamp": 1763758907, "label": "1"}
{"original_topic": "adolescence", "comment": "What is Puberty? Decoding Puberty in Girls", "timestamp": 1763758907, "label": "0"}
{"original_topic": "adolescence", "comment": "All About Boys Puberty", "timestamp": 1763758907, "label": "1"}
{"original_topic": "adolescence", "comment": "Why Are Teens So Moody?", "timestamp": 1763758907, "label": "1"}
{"original_topic": "adolescence", "comment": "Adolescence  Adolescence an a period of fear and a need for information for a person going through it. Many questions arise whether the changes are normal or a form of abnormality.  Despite the fear tiu may have this is perfectly normal. Your body is just preparing for adulthood. With all these changes happening it's better to ask questions and get the information needed because this calms the mind and reminds you that you are not alone. So dont be scared but embrace the changes.", "timestamp": 1763758907, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Jesse is not a victim This is something I've been wanting to talk about for a while now, so here goes. I honestly don't understand the whole victimization of Jesse in this show. I agree he suffered some horrible stuff throughout the show, but let's not pretend Jesse's not screwed up so many situations. He led Hank to the RV, he got high with Jane which caused Walt to miss his child's birth, he spent Walt's money on hookers when it was supposed to be spent for buying an RV, and the stupidest of all, attempting to kill the two drug dealers. I can go on and on about this. He is not innocent! This is contradictory to a comment I made on an earlier post, where I stated that he had a stronger moral compass, but that doesn't mean he's a good guy lol. At the end of the day, the guy is a murderer, a guy who tried to sell meth to recovering addicts, and a guy who cooked meth. Simple as.", "timestamp": 1763758908, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Ironically, Walter suffered for the things he didn't do. Aside from the obvious main point—being the biggest methamphetamine dealer in Latin America and a mafia boss—the things that REALLY setted his end, were supposedly killing Hank, hiring a guy to kill Jesse and manipulating and abusing Skyler for his own benefit—the only things he didn't do.\n\nNothing about Brock, nothing about continuing in the business even when he didn't need to, nothing about Jane, nothing about denying the financial support of his former friends. The worst things that fell on his conscience were the ones he didn't do.\n\nIt shows how he completely lost control of the consequences of his actions. I confess I felt sorry for him in the scene where Walter Junior blames him for Hank's death (not because he's a poor guy, but because he genuinely tried to save him).", "timestamp": 1763758908, "label": "0"}
{"original_topic": "breaking_bad", "comment": "I know I’m gonna seem super slow for saying this but I just realized the parallels between these two &amp; it’s amazing. Honestly I don’t think my interpretation is beyond surface level because I’m pretty sure anybody more developed than me could already see it for what it is lol but it’s just so amazing that do these two not only kill someone back to back (episode wise) but both parties have opposite reactions to it. Walt has to save Jesse’s life and basically doesn’t hesitate once he realizes what needs to be done (I think personally at the dinner scene before leaving you can see he was visibly angry, if anything just as angry as Jesse was) and kills without a SECOND thought. Next episode Jesse has to kill Gale but unlike Walt, as soon as the realization comes to the surface there’s not only extreme hesistance but it’s for a good moral reason; Gale is still innocent so there *has* to be another solution, right (as opposed to Jesse’s firm stance that the dealers needed to die for what they were doing and ended up doing in the end)? Jesse does end up doing what he has to do, but you can see the man’s actually tore up about and I suppose if we want to take it further than these two episodes Walt has no remorse for Gale while Jesse does but they both have no remorse for the dealers that got killed.\n\nAlso side note, it’s sort of unrelated, but sometimes I think of how in season 1 episode 3 when they knew what had to be done to Krazy-8, Walt was very hesitant on doing so &amp; was crying at the end like Jesse while Jesse was very insistent (to be fair though, the coin flip **is** sacred).\n\nI really like this show.", "timestamp": 1763758908, "label": "1"}
{"original_topic": "breaking_bad", "comment": "First rewatch in a while...pilot episode: I just rewatched BCS, and why not, go back to BB. Why did I not catch Walt positioning a weapon to his head to off himself in the very first episode?? It's there, he pulled the trigger, clearly didn't fire, otherwise there'd be no story. \nWas he always suicidal, esp after the diagnosis? A friend once said, the most selfish thing you could do is suicide. Now do I have more perspective with Walt's selfishness as I rewatch?", "timestamp": 1763758908, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Just finished watching for the first time What an amazing show. The writing and acting were incredible. Conflicting feelings about the characters and who to root for and despise. Incredible tension and unpredictability. \n\nPoor Hank and Marie.  All of the clues were there. Saul running for his life. Gus adjusting his tie…\n\nWatched El Camino last night, glad to see Jesse get out\nWife and I agreed we need to watch something lighter and humorous for a while, then go to BCS", "timestamp": 1763758909, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How would Walt be as a scientist? Af far as I an aware, I hear that Walter dropped his PHD or something and never finished his education entirely. And that being part reason why Walt was a chemistry high school teacher and not something else involving chemistry.\n\nIf that information is correct. How would you peps estimate his apparent genius in chemistry if he had a full commitment into deeper level of chemistry?\nMight be a silt question :P\nBut I would like to hear if his passionate intellect in chemistry would bear fruit in the field. Or if he would most likely have not another Nobel prize contribution.", "timestamp": 1763758909, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How difficult would it have been for Walt to get to Gus in face off had Mike been there beside Gus ? What strategies could he have used ? I believe Mike not being by Gus’s side was a huge reason why Walt was able to outsmart gus cause he let his hatred for hector blind him to any kind of reason, which Mike would have pointed out since he doesn’t have a vendetta against hector like Gus does", "timestamp": 1763758909, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Do you guys think Mike told Gus the entire truth about what happened with gale/walt/jesse I know that in the Werner Ziegler escape there wasn’t much Mike could do but accept responsibility cause he can’t hide Werner’s escape from Gus. Just as he can’t hide gale being murdered by Jesse. But Mike not thinking things through and under estimating Walt and giving Walt the chance to contact Jesse was directly what made gale get killed. From Gus’s point of view I can see him being livid and blaming Mike entirely for what happened. Victor is an idiot and more of a muscle but Mike is supposed to be the one who’s always ten steps ahead of everyone. So do we think Mike omitted the part he played where he’s directly responsible for gale getting murdered like did he just tell Gus that while Walt was in the laundry Jesse had somehow gotten to gale and killed him? \nThere was genuinely no reason for Mike to give the phone to find out Jesse’s location cause Mike could have found Jesse all by himself without too much trouble.", "timestamp": 1763758909, "label": "0"}
{"original_topic": "breaking_bad", "comment": "\"Which Breaking Bad character did you find the most annoying?\" For me, Skyler White is easily the most annoying character. In the early seasons, she felt like a constant buzzkill, always nagging Walt and treating him like a child instead of a partner. It wasn’t just that she opposed his crimes; it was her passive-aggressive attitude and how she constantly played the victim while refusing to really listen. Then, her affair with Ted Beneke just felt petty and vindictive. On top of that, she often acted morally superior despite eventually laundering money herself. And honestly, that Marilyn Monroe 'Happy Birthday' scene was so cringeworthy I almost had to stop watching.", "timestamp": 1763758909, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Watched breaking bad 12 times now, and this is my only problem! Jesse pinkman being stupid and annoying is not cute anymore, kind of cringe, but still my favorite character.", "timestamp": 1763758909, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Walt and Jesse fighting is usually hilarious, but this scene was just depressing to watch.", "timestamp": 1763758909, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Would you consider Mike a cartel member? He does end up working for Gus Fring, someone who is tied to the cartel in Breaking Bad and Better Call Saul.", "timestamp": 1763758909, "label": "1"}
{"original_topic": "breaking_bad", "comment": "A moment no one talks about The fact Walt almost killed himself in the first episode is crazy to me. It could’ve all ended there and then, the fact he was willing to do it was the sad part.", "timestamp": 1763758910, "label": "1"}
{"original_topic": "breaking_bad", "comment": "The whole premise of this show is ridiculous. I can't get past it. It's a good show but the coincidence of how things get started is just ridiculous. Walt just *happens* to live in ABQ, which is the same town Gus Fring just *happens* to be in? And he just *happens* to have Jesse as a student, who just *happens* to end up cooking meth? Mike *happens* to move to ABQ too and *happens* to meet Gus? And Saul just *happens* to be in the city too, and they just *happen* to choose him? It's completely ridiculous. In reality these people probably would be all over the US and never even would have met each other. Every time I watch this show I can't help but just laugh my ass off at how ridiculous it all is.", "timestamp": 1763758910, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Difference in flashback scene and episode scene of the \"Willy Wonka? Walter White?\" In season 4 episode 4, when Hank and Walter are looking at Gale's notebook and he says the \"Willy wonka? Walter White?\" line, the camera pans to Walter between \"Willy Wonka?\" and \"Walter White?\". In the flashback scene, when Hank realizes that Walter is Heisenberg, the camera stays on Hank between \"Willy Wonka?\" and \"Walter White?\".\n\nWhat does this mean? Because when they are looking at Gale's notebook, the \"Walter White?\" is way more easily interpreted as a joke, in the flashback scene, Hank has a kind of suspicious look when he says \"Walter White?\". Did they not want you to think that Hank was possibly suspecting Walter a little bit? Why did they do this? Maybe this has been discussed already, I just noticed this little detail and was curious.", "timestamp": 1763758910, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Gif find Anyone got the gif of this scene when Walt walks into the home in season 5?, keep seeing it lmao and I can't find the gif for it", "timestamp": 1763758910, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Fly intro Would the episode be as bad without the \"hush little baby\" super close up of a fly intro?\n\nDefinitely not the best episode but it just starts off with a weird vibe.", "timestamp": 1763758910, "label": "0"}
{"original_topic": "the_100", "comment": "Any talented folks want to tackle a season 1 intro?      Boy would it be awesome to retroactively add in a S1 intro like the rest (man did I yell with joy the first time it played in 2x02!!)  using the best theme song in TV history 🥰 and all the S1 locations, even spoiler-y (or not) since it’s after the fact.   \n     Any graphic artist types willing to give this a shot?  Then we can all insert it into our S1 rewatches 😎😎😎", "timestamp": 1763758910, "label": "0"}
{"original_topic": "the_100", "comment": "I need help understanding this line from Dante in the middle of S2 I’m currently rewatching the series and I caught a line in Season 2 from Dante during the time Cage is trying to convince him to allow for further experimentation on the 47. When Cage takes him outside the bunker and says that he can take his suit off, Dante says “I had forgotten the smells” as he takes off his mask. I know at the beginning of the season he tells Clarke that he had been outside for 5 minutes as a kid, but he would have had to have his full suit on and wouldn’t have experienced the smells of the outside without it. What does he mean by saying that he had forgotten it?", "timestamp": 1763758910, "label": "0"}
{"original_topic": "the_100", "comment": "Books vs series I kinda wanna read the books but I know that the story is a lot different but I’m still curious cuz I wanna know if the ending will piss me off as much or if it’ll be satisfying. I’m also curious what the similarities are like the plots of each season if they’re original or based on the books. I wish that there weren’t sooo many characters that don’t exist in the books cuz a lot of em are my favorites, but I absolutely love the world building and since there’s no spin offs I’m dying to see more of this world. Anyone who’s read the books can you tell me what you think without spoiling it?", "timestamp": 1763758911, "label": "0"}
{"original_topic": "the_100", "comment": "WHY ARE THEY TAKING IT OFF NETFLIX 💔 my comfort show, i never thought i’d see the day where the little red writing appeared below the show telling me it’s leaving soon 💔 i definitely shed a tear and felt my heart break. i don’t know what i’m gonna do without my comfort show. does anyone know where else to watch it? 💔", "timestamp": 1763758911, "label": "1"}
{"original_topic": "the_100", "comment": "What's your favorite dumb moment on the show? Like plot holes, bad props, all of the \"science\"? I love this show but the CW of it all has me laughing.", "timestamp": 1763758911, "label": "0"}
{"original_topic": "the_100", "comment": "I can’t stand Jasper in seasons 3 &amp; 4. I don’t care if they were trying to make him the “realistic one”.", "timestamp": 1763758911, "label": "1"}
{"original_topic": "the_100", "comment": "Will HBO MAX have the 100 after it leaves netflix in December? ?", "timestamp": 1763758911, "label": "1"}
{"original_topic": "the_100", "comment": "Leaving Netflix I’m sure most people here probably now but the show is leaving Netflix on December 18th", "timestamp": 1763758911, "label": "0"}
{"original_topic": "the_100", "comment": "What is your dreamed Storylines that inspired by Novel, etc for Season 6-7 For me here is my\n\n• To Serve Man Novel (Storyline similar where only Raven realizes but nobody believes her until end)\n\n• Reanimated Corpses similar to Necromorphs (Unknown disease found in the Ark slowly turn everyone excluding those extremely smart)\n\n• Alien Invasion of Ark (Ark Council indirectly caused everyone receiving A Fate Worst Then Death)\n\n\n\nWhat about you", "timestamp": 1763758911, "label": "0"}
{"original_topic": "the_100", "comment": "Octavia is insanely cringe wtf I feel like the show is going downhill after season 2 and I've already accepted it but the floor kid leading and being better than grounders who have been fighting for their whole lives fills me with so much cringe that it physically hurts lol. Surely I can't be the only one that feels that way right ?", "timestamp": 1763758911, "label": "0"}
{"original_topic": "the_100", "comment": "Can someone please make an edit of the 100 to The Only Thing Left by Vincent Lima Just listened to this song for the first time and I feel like it would be PERFECT for the 100. Not sure which couple in particular, maybe Clarke and Lexa or just a mix of couples? Please go listen to it if you haven't heard it before and tell me it's not perfect lol", "timestamp": 1763758912, "label": "1"}
{"original_topic": "the_100", "comment": "Most random characters in The100 \\-Bellamy imaginary  girlfriend\n\n\\-everyone best friend Riley\n\n\\-budget Cooper\n\n\\-that black market woman in S1 on the Ark\n\n\\-primehard characters showing up in the last 2 episodes of S6 (did the guy who was supposed to brainwash Jordan dies in S7 or what?)\n\n\\-Knight the grounder whose sole purpose is to oppose indra\n\n\\- X Y Z the heroes who saved sanctum in S7…\n\nBEST RANDOM CHARACTER (a character showing up out of thin air becoming a good character): Madi\n\nWORST RANDOM CHARACTER (a character showing up out of thin air becoming a terrible character): Shitheda\n\nM.I.A. CHARACTER: Gaia (to the point  she’s played by a stunt double in the season finale)", "timestamp": 1763758912, "label": "0"}
{"original_topic": "the_100", "comment": "Clair de lune I realized Clair de lune was playing in 2x3 which got me so hyped lol. I kinda figured at that point they had something more sinister at play.", "timestamp": 1763758912, "label": "0"}
{"original_topic": "the_100", "comment": "Season 1 Ok so obviously they were sent down on year 97 but we all know they couldve gone earlier So my theory on when they couldve gone is that the first kids born in space could have been on the ground because we know the mountain men could only survive with radiation proof bone marrow and that happens by adapting your marrow to the environment your born in so they form the ark on what year 3 out of 100 and they pop some kids out and sent down on year 20 of 100", "timestamp": 1763758912, "label": "0"}
{"original_topic": "the_100", "comment": "Polis and azgeda If the grounder coalition had problems with azgeda agression why didn’t they just build a medieval like wall around polis? There was plenty of debris left over from the bombs so it’s not like they couldn’t.", "timestamp": 1763758912, "label": "1"}
{"original_topic": "the_100", "comment": "Should I watch past season 5? I stopped watching sometime 2017 and I’m rewatching now, DETERMINED to finish. But… I’ve heard more than one person say that season 5 is the better ending. \n\nFor context I am a Bellarke but I also love Lexa and there are plenty other characters I care about just as much.\n\nI’ll most likely try to finish all 7, but what’s the common consensus on this sub?", "timestamp": 1763758912, "label": "1"}
{"original_topic": "the_100", "comment": "Bellamy is owed an apology I finally finished watching The 100. Bellamy was right. And Clarke shot him. Then, O &amp; Echo instantly forgave Clarke. \n\nWhen they realise he was right about the whole transcendence thing, where was the regret from Clarke? Where was the anger from O &amp; Echo? Poor Bellamy.", "timestamp": 1763758912, "label": "1"}
{"original_topic": "the_100", "comment": "Given the budget and non MA/TV-14 rating, this is one of the best shows I've ever seen Game of Thrones was more violent and had nudity. Same story with The Sopranos. Those are 2 of my all time favorite shows. I can't believe this little CW show ended up being so good! I'm on my 3rd re watch now. The acting, writing, creativity, suspense and drama here are all top notch. I was a skeptic and put this show off for years. I thought without the TV-14/MA rating, I wouldn't be interested. Boy was I wrong. I tend to like more \"real world\" shows (Yes, I know I like GOT). I've never seen any Lord of the Rings or any Harry Potter and don't venture in to Sci-Fi often. I thought that was the target audience here. After my first two watch's of The 100, I couldn't stop thinking about it. To me, it's the best non rated R series ever next to Breaking Bad. What a fun ride from start to finish. Bravo 100, you knocked this outta the park!!!", "timestamp": 1763758912, "label": "1"}
{"original_topic": "the_100", "comment": "Was it ever explained how Mount Weather... Was able to feed all their citizens a full buffet every day? I know they're on the ground so it's not the same situation as the Arks limited resources, but they were still all locked inside every day so I doubt they were able to have a garden growing outside? Unless it was like how the Praimfaya bunker had an underground garden, but much better equipped since it was a military facility? Was this ever answered or what do you all think?", "timestamp": 1763758913, "label": "1"}
{"original_topic": "the_100", "comment": "First Watch I just finished my first watch-through of The 100, and I loved the earlier seasons, pre-S06.  It seemed that things fell apart for me once they left Earth.  I realize that there may have been delays in production and cast changes, but it seemed like a huge departure from the overall plot.  I realize it is just me... but.  \n\nI really liked the story arc of Octavia and Indra, but hated the arc of Bellamy.  The way they handled Emori's death was sweet, and I understand that Murphy had to pay some sort of a price for his horrible mistakes.  Clarke's arc seems about right... But I do feel that she did everything for the betterment of her friends and her people... and killing the guy in front of the judge kind of seems forced. \n\n  \nThe ending I do not like.  I do like that her core people come back to be with her... but I don't like that they are ostracized and they can't repopulate.  IDK, it seems like that is too harsh a punishment when all the others (presumably all humanity) got to transition regardless of the \"sins\" they have committed.", "timestamp": 1763758913, "label": "0"}
{"original_topic": "the_100", "comment": "Pluribus has season 7 vibes     Without spoiling the details of the excellent new show Pluribus (beyond its trailer), it seems like a highly nuanced exploration of humanity forced into a hive mind, very similar in many ways to The 100’s transcendence, and whether “we” would be better off that way or not.   I think The 100 could have really explored that theme much more deeply if ‘book 2’ was given at the very least another season, which we all know didn’t happen for many reasons, and would have made s7 much less rushed (yes I know that’s only one of its problems lol).    Anywho, check it out if you haven’t.", "timestamp": 1763758913, "label": "1"}
{"original_topic": "the_100", "comment": "So what would happen if a father had two kids? In the 100, we know that if a woman has two kids, she's floated, but what if a man has a kid with two different women? Would that technically get him floated?\n\nI want to write a fic and possibly have Wells have a younger sibling and I'm just trying to figure out how it would work", "timestamp": 1763758913, "label": "0"}
{"original_topic": "the_100", "comment": "I think I need to rewatch this show. I watched it a few years ago with my brother.  For some reason it won’t get out of my head recently.  Mostly I just feel sad because of all the sad parts, and as long as I keep thinking about it, I keep feeling sad.  So I think the only way to stop thinking about it is to rewatch it and finally put the whole thing to rest.", "timestamp": 1763758913, "label": "0"}
{"original_topic": "the_100", "comment": "I like Pike I don't agree with what he did but DAMN, not only does he have mad aura. He's also hot as shit.", "timestamp": 1763758913, "label": "1"}
{"original_topic": "the_100", "comment": "The 100 as a modern video game. Do it! If Starfield, Fallout and Diablo 4 had a baby! Maybe a bit of Assassin’s Creed…\n\nBoom! \n\nThe 100 video game. \n\nI wanna play as Octavia! 🫶🏻", "timestamp": 1763758913, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Daily reminder that neither Mike nor Walt were \"right\" or \"wrong\", they were both pretty terrible people I saw a post yesterday about how Mike was wrong in his argument against Walt about how they had a good thing and Walt blew it up. I actually don't disagree with everything said about Mike's \"points\". I agree with a lot of it. \n\nI think Gus had Tomas murdered or at least knew that's what the dealers would do. Think about it. Gus' big thing is that his people don't operate without his consent or knowledge. Gus liked these dealers so much, he risked his relationship with Walt to protect them. There's no way they did that without Gus having at least mild knowledge of it. I think it was a play to get Jesse killed. Jesse goes to retaliate, believing Walt wouldn't care or react or even know about it until Jesse had already gone to the dealers. They were already waiting for him, Jesse gets gunned down and Gus consoles Walt after having the dealers killed by Mike for killing Tomas and causing the situation to begin with. Now Gus has Walt, his perfect lab and no more \"junkie\". Walt knew this, he figured it out and literally told Gus that hypothetically Jesse might have believed it was Gus' doing. The show writers wouldn't have Walt say this unless they wanted us to think about it. \n\nBut does that make Walt the good guy? Or Mike? No. Mike wanted to kill Jesse for a long time. He wanted to kill Jesse just for doing drugs after his girlfriend died. Literally told Walt, \"Let me take care of it\" intending to kill Jesse at a drug house when he was consumed with grief. The same Mike that we're supposed to believe saw Jesse as a son. \n\nOn the flip side, Mike figured Walt out and knew exactly what kind of man Walt was. Walt isn't a saint. He kept Jesse alive for his own selfish reasons. He used Jesse, manipulated him, took advantage of him. And let's not forget... Walt caused Jane to turn over and choke and then stood there while she choked. Walt is also the reason they got mixed up with Gus to begin with. \n\nHere's the list of garbage moves Walt made that caused Jesse's life to get progressively worse at every turn: \n\n1. When they were making cash hand over fist, Walt freaked out about Skinny Pete getting mugged which is absolutely a thing that dealers have to deal with. This put Jesse in a compromising situation for a wad of cash that they could easily make back on the back end. No retaliation is bad for business? You can retaliate in other ways. Black list those \"customers\" and they'll find a way to pay you back. Like Jesse said, they had the best product and no one else was dealing because Tuco was dead. \n\n2. After Jesse gets caught up in a situation that leads to a man's death, he starts getting cocky and pushes for them to expand. He tries to act like a know it all, pulling out a map and *teaching* Jesse, the one who is in charge of business, new areas to expand to. Jesse literally warns him that going into new territory will lead to violent encounters but Walt is happy to milk the MISBELIEF that Jesse killed Spooge even though he knows Jesse and his crew are no killers. At this point, they don't even have junior dealers working for Badger, Skinny Pete or Combo. \n\n3. Every single thing that Jesse warned Walt about happens. First, Badger gets arrested which costs them $80k to resolve. This also loses them a dealer. And then, disaster: Combo gets killed. Where? In new territory where Gus' dealers are. This means they're down two dealers and only have Skinny Pete. And he naturally wants out because Combo is dead. This also puts Jesse under tremendous stress which leads to him leaning heavily into drugs. Walt starts worrying about how they're going to sell 50 pounds of product, but he doesn't seem AT ALL worried about Jesse. He finagles a deal with a guy who knows a guy who knows a guy and manages to get a deal to sell all of his product to Gus. At this point, there's no doubt that Gus is most likely buying it just to get it off the market. \n\nThe entire reason they end up in business with Gus, the entire reason Combo was killed by Gus' dealers, the entire reason this whole business deal with Gus even starts is due to **WALT'S EGO**. His ego is also what led to them having their run-in with Tuco. Walt was angry about $1500-$2000 a day being too slow for him and wanted to sell to a distributor. Walt was angry about needing pseudo for a traditional cook so he concocted the plan to steal methylamine. Out of everyone, Gus and Walt are the only ones who didn't want to \"get out\" of the business. \n\nMike was a lot of things, and up until he finally warmed up to Jesse, he was a piece of shit in a lot of ways, but he wasn't in the business to be in the business. He was happy to get out ahead at various points in the series. Him and Jesse were willing to walk away, sell their shares of the methylamine and walk away with more money than they could've earned in a lifetime. But who wanted to stay? Walt. \n\nIt's easy to see Walt as the reasonable one who wanted to help Jesse. But it's important to understand that almost every time Walt \"saved\" Jesse, he was saving Jesse from a horrible situation that **he himself** put Jesse in.", "timestamp": 1763758913, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Would Walter or Jesse ever rat each other out to the FBI if caught or remain loyal? Just in case Walter or Jesse ever got arrested or caught red-handed separately or together, would these guys ever rat on each other to the police and FBI to save themselves or would they remain loyal?\n\nAlso why didn't Walt rat out Gus or set him up after he  dominated his life? Would Gus rat on anyone? Would Skinny Pete and Badger rat on Jesse and Walt if they got into trouble?", "timestamp": 1763758914, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How they all live in nice houses, yet don’t have the money for medical care The Whites live in a good house with a pool. I mean, it’s  not a mansion, but it’s a decent place. Yet, they don’t have the money to pay the bills, and cancer bills specifically.\n\nHank and Marie live in a real nice house too, but didn’t have the money for Hank’s physical therapy.", "timestamp": 1763758914, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Finished Breaking Bad after watching it for the first time As you can see I'm many years late but yesterday I just finished the series and it has completely set the bar for any television series I watch after which I'm sure is a universal experience for all the fans. I remember in high school when Tumblr was huge how big the show was and how much hype was behind it. I'm not really a huge tv person nor do I usually give into the hype of things but a few months ago I was looking up \"best television series of all time\" and of course Breaking Bad was consistently mentioned as being #1. I'm so happy I finally got around to watching the series, I'm just sad that I'm so late. The entire cast was phenomenal, every episode from the very first one pulled me into and kept me surprised, entertained and yet astonished at how beautifully it was shot. I can't even explain how incredible this show is. I hope Vince or Bryan or Aaron write a novel about the experience of it all some day. And now I plan on visiting New Mexico!", "timestamp": 1763758914, "label": "1"}
{"original_topic": "breaking_bad", "comment": "I don’t get this line", "timestamp": 1763758914, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Least favourite characters?", "timestamp": 1763758914, "label": "1"}
{"original_topic": "breaking_bad", "comment": "My final rating for each season of breaking bad I found season 5 forced because of things like Lydia moving an entire drug empire alone, deaths that had no investigation whatsoever, prison deaths with no police around to stop them and many other things.", "timestamp": 1763758914, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Unexpected BB reference in Batman/Superman World's Finest #10", "timestamp": 1763758914, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer talks about the atomic bomb - Interview 4k Colorized (1965)", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer Interview (1965) – Was the Atomic Bomb Necessary? | HQ Colorized", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Barbie vs. Oppenheimer - Epic Rap Battles of Twin Releases (Feat. garbageGothic, S.R.P. &amp; Zawesome)", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "💎💎💎💎💎💎Thanos vs jJ Robert Oppenheimer ☢️", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer ~ 𝑪𝒂𝒏 𝒀𝒐𝒖 𝑯𝒆𝒂𝒓 𝑻𝒉𝒆 𝑴𝒖𝒔𝒊𝒄", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "School poster For my school i need to make a poster about a famous physicist. I figured i wanted to make a poster about Robert Oppenheimer. But i dont know anything about him. Anyone can help me out with things i should include??", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer edit❤️", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Christopher Nolan's Magnum Opus", "timestamp": 1763758915, "label": "1"}
{"original_topic": "oppenheimer", "comment": "I have found opennheirmer phone number  (931) 307-0135", "timestamp": 1763758916, "label": "0"}
{"original_topic": "oppenheimer", "comment": "This is such a cool shot.", "timestamp": 1763758916, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer and the Chevalier Incident? How about Lewis Strauss and the Chicanery Incident https://www.reddit.com/r/betterCallSaul/s/TzUJhYxDPd", "timestamp": 1763758916, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer (2023) [ambience]", "timestamp": 1763758916, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Why Oppenheimer is a disgraceful movie", "timestamp": 1763758916, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer - Destroyer of Worlds", "timestamp": 1763758916, "label": "1"}
{"original_topic": "oppenheimer", "comment": "OPJE - DP and Mobile Wallpaper #OscarWinningMasterpiece", "timestamp": 1763758916, "label": "0"}
{"original_topic": "oppenheimer", "comment": "What Really Happened to Oppenheimer?", "timestamp": 1763758916, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer Convert Event With Christopher Nolan and Cillian Murphy", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "My Top 15 Favourite Films of 2023", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer is in the r/FavoriteCharacter Bracket", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "OPPENHEIMER: A Nuclear Experience (Video Essay) Here's to the Best Movie of 2023! Happy New Year everyone!", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Top 10 Best Movies Of 2023", "timestamp": 1763758917, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer | Original Trailer", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Honest Trailers | Oppenheimer", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "The Beauty of OPPENHEIMER", "timestamp": 1763758917, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Do you all think Oppenheimer was sapphic?", "timestamp": 1763758918, "label": "1"}
{"original_topic": "wednesday", "comment": "Enid Cosplay... Tiktok https://preview.redd.it/abxuq8lxun2g1.png?width=168&amp;format=png&amp;auto=webp&amp;s=67d621b72a71601a22a8d9d620b89f5ee1d636fb\n\n[https://www.tiktok.com/@.kitsumimi/video/7565253117231631629](https://www.tiktok.com/@.kitsumimi/video/7565253117231631629)\n\n[https://www.tiktok.com/@.kitsumimi/video/7567479074080263437?is\\_from\\_webapp=1&amp;sender\\_device=pc&amp;web\\_id=7495502339836331525](https://www.tiktok.com/@.kitsumimi/video/7567479074080263437?is_from_webapp=1&amp;sender_device=pc&amp;web_id=7495502339836331525)\n\n[https://www.tiktok.com/@.kitsumimi/video/7566308602735004942?is\\_from\\_webapp=1&amp;sender\\_device=pc&amp;web\\_id=7495502339836331525](https://www.tiktok.com/@.kitsumimi/video/7566308602735004942?is_from_webapp=1&amp;sender_device=pc&amp;web_id=7495502339836331525)", "timestamp": 1763758918, "label": "0"}
{"original_topic": "wednesday", "comment": "Visiting Netflix House Philadelphia &amp; \"Wednesday - Eve of the Outcasts\"", "timestamp": 1763758918, "label": "1"}
{"original_topic": "wednesday", "comment": "Artist: Juanmaoao **Yoko**: Enid! Why are you wearing \"Wednesday\" make up lately too?  \n  \n**Enid**: Why? Wow! Sometimes i want to try a new style!  \n  \n\\------  \n  \n**Enid**: I really want to try this year's new spring shades...  \n  \n**Wednesday**: If you like It, buy It; stop making those puppy-like whimpers.  \n  \n**Enid**: I don't want It!  \n  \n*\\*KISS\\**  \n  \n**Enid**: Kissing freedom is more important, you idiot Wednesday!  \n  \n**Wednesday**: ... You know you can kiss me after i tale my allergy medication, right?  \n  \n**Enid**: AH CUTE!", "timestamp": 1763758918, "label": "0"}
{"original_topic": "wednesday", "comment": "Big Smoke's Order ❌️ Enid's Order ✅️ (I tried combining steak sauce with chocolate syrup... let's just say, I still haven't got my appetite back yet)", "timestamp": 1763758918, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday by Hot Toys Loving this figure so much ! Made a themed inspired diorama for her ! Insta : [sidetoys](https://www.instagram.com/sidetoys?igsh=MXFpZHE4M2cxZGpn)", "timestamp": 1763758918, "label": "0"}
{"original_topic": "wednesday", "comment": "Art by: isatpanart", "timestamp": 1763758918, "label": "1"}
{"original_topic": "wednesday", "comment": "Wednesday dance in game btw the game is once human", "timestamp": 1763758918, "label": "1"}
{"original_topic": "wednesday", "comment": "A subtle gag in The Addams Family is that they make things up In the 1991 'The Addams Family' movie, the Addamses deliberately embellish, misstate, or exaggerate things to add gravitas, making themselves seem more heretical and in touch with darkness. The Netflix show continues this, but Wednesday takes a more philosophical approach rather than a dramatic or blasphemous one. (see Gallery)\n\n\\---\n\n[Agatha Christie Community Forum](https://community-archive.agathachristie.com/discussion/707/three-coincidences-are-a-proof-its-real-ac-quote)", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday Addams Short Just a joke video about Wednesday Addams reacting to her roommate Enid becoming the worlds loudest snorer.", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "Some Weds &amp; Enid draws [https://www.zerochan.net/3888993](https://www.zerochan.net/3888993)\n\nhttps://preview.redd.it/612i11jpej2g1.png?width=920&amp;format=png&amp;auto=webp&amp;s=34a85edbac7b22e1e530b6b13fd60c67ecda3520\n\n[https://x.com/yellow\\_nicky/status/1624800455590088709](https://x.com/yellow_nicky/status/1624800455590088709)\n\nhttps://preview.redd.it/rertmx7vej2g1.png?width=680&amp;format=png&amp;auto=webp&amp;s=ffc46ba64396a1aad8ee0d14d5ba405c044ae9cd\n\n[https://www.facebook.com/oceaninspace/posts/now-that-wednesday-season-2-is-out-it-made-me-realize-i-never-actually-posted-th/1366265981532126/](https://www.facebook.com/oceaninspace/posts/now-that-wednesday-season-2-is-out-it-made-me-realize-i-never-actually-posted-th/1366265981532126/)\n\nhttps://preview.redd.it/wf7pcqv3fj2g1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=f7b2f39efb80305cd034cce5b4551e3a47102e1b\n\nhttps://preview.redd.it/mobire97fj2g1.png?width=1212&amp;format=png&amp;auto=webp&amp;s=4de15ce88b0dd139084e0bbc20a4d42bbfeb454e", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "Enid's cosplay Tik Tok \n\nhttps://reddit.com/link/1p2p1qr/video/k2l9biqadj2g1/player", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "Weyler Art Artist: Doodlez", "timestamp": 1763758919, "label": "1"}
{"original_topic": "wednesday", "comment": "I really wish Tyler and the other Hydes were written more like actual Jekyll-and-Hyde monsters Basically, exactly what the title says. A lot of the writing in this show is… let’s call it “wonky,” and the show's lore suffers from it. The Alpha werewolf lore feels like it was made up in 5 minutes, and the Hyde lore isn’t much better. The show dedicated two seasons to Hydes, and it still feels all over the place.\n\nHydes are clearly inspired by Robert Louis Stevenson's novella *The Strange Case of Dr. Jekyll and Mr. Hyde*. In the novella, Dr. Henry Jekyll develops a potion to separate his good and evil sides. When he drinks it, he transforms into evil Edward Hyde. Over time, Jekyll's transformations become more frequent and involuntary. The novella ends with Jekyll's final, unchangeable transformation into Hyde, who then commits suicide. Throughout the story, Jekyll remembers everything he does as Hyde. Hyde is not a separate personality that takes over Jekyll's consciousness; rather, Hyde is Jekyll acting without his usual inhibitions, and Jekyll is fully aware of Hyde's actions. Essentially, Jekyll tries to use the transformation to indulge in his darker impulses.\n\nThat’s a very cool concept. And in Season 1, it seemed like the show was going in that direction. Tyler’s first transformations are triggered by Laurel’s chemicals. Maybe not at first, but over time, he becomes fully aware of his actions as a Hyde and starts enjoying them, because they give him the freedom to act on impulses he normally suppresses. That tracks with the original novella. But then the show adds lore that honestly makes everything messier: the **“master”**.\n\nAt first, I get it; writers needed a way to justify Laurel controlling Tyler and tie the twist together. Fine. But Season 2 introduces Tyler’s mother, and suddenly the whole “master” concept becomes a narrative roadblock. So now apparently female Hydes don’t need a master, only male Hydes do. BUT the master’s control seems optional because Tyler kills Laurel and fights his own mother, AND male Hydes supposedly go “insane” without a master, AND they still die young because each transformation shortens their lifespan. It really sucks being a male hyena. I mean Hyde.\n\nSo… what does a “master” even mean anymore?\n\nIt just feels *messy.* I wish they had stuck closer to the original Jekyll-and-Hyde idea rather than constantly adding plot-convenient rules that contradict earlier ones. And it’s not just Hydes. The Alpha werewolf lore is equally vague and inconsistent.\n\nSeason 3 is going to expand the Hyde/werewolf lore even more with Capri and her mix of Hydes and werewolves, and honestly? I’m scared that by the end of it, things are going to be even more convoluted than they already are, when they really don’t need to be.\n\nAlso, as I was finishing typing all of this, I remembered that in Season 1, Xavier had some weird psychic connection to Tyler/Hyde, which the show never explained. But I guess we’re never going to learn how or why that worked. Oh well…\n\nJust some of my thoughts. What do you guys think about Hydes and how the show handles their lore?", "timestamp": 1763758919, "label": "1"}
{"original_topic": "wednesday", "comment": "Rehabilitating Enid This just came to me.\n\nThe scene is, Wednesday and Fester have found Enid in wolf form, in the woods of Ontario, Canada. Fester leaves them the motorcycle and goes off into the woods for some reason, maybe to find bugs and other food. Wednesday and Enid fall asleep together, and when they wake, Enid is human again.\n\nEnid is in shock from the experience. She can barely speak. Wednesday drives her to a coffee shop (after dressing her in the spare outfit she had in her backpack.) When they get there, they talk, while in the background, this music is playing on the radio. \n\nGo to exactly the 1 hour mark to her the music I am talking about.\n\nhttps://www.youtube.com/watch?v=B3JmtMCJ0ok", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "\"Be Thankful You Can Be Seen...God Bless You\" Agnes's cartoon references and the pyre clue as early foreshadowing.", "timestamp": 1763758919, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday &amp; Enid - The Fire", "timestamp": 1763758920, "label": "0"}
{"original_topic": "wednesday", "comment": "Enid and Wednesday good luck babe edit. Credit: Grace Marchello on youtube Why are there not more wenclair Chappell Roan edits? Her songs are perfect for them.\n\nAnd the way this one uses the bridge in the song, amazing", "timestamp": 1763758920, "label": "0"}
{"original_topic": "wednesday", "comment": "Family Values🕸", "timestamp": 1763758920, "label": "1"}
{"original_topic": "wednesday", "comment": "Art by: PurpleKetchup16", "timestamp": 1763758920, "label": "1"}
{"original_topic": "wednesday", "comment": "Tyler getting dragged into actual Hell and Wednesday saving the day (again) All the Devil, Satan, and Lucifer references are pointing to one infernal destination--as if Wednesday's death drive could resist intervening.  \n  \n*-crappy edit is mine of course*", "timestamp": 1763758920, "label": "0"}
{"original_topic": "wednesday", "comment": "[Credits to @beries_popculture on YouTube] https://youtu.be/-CGMcEk4GXY?si=wI7CxJN_PXjayy3D", "timestamp": 1763758920, "label": "0"}
{"original_topic": "wednesday", "comment": "Remembering that Wednesday is still an anti-heroine Having a strong moral doesn't make her \"less Wednesday\" as many have a somewhat incorrect stereotype of this version of the character.\n\nLet's remember that she didn't kill Thornhill or the killer at the beginning of season two.\n\nUnlike a hero, the anti-hero certainly tends to carry out \"dirtier\" actions but the goal of helping those around him/her always remains and Wednesday, for better or worse, is also this.", "timestamp": 1763758920, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday series", "timestamp": 1763758920, "label": "1"}
{"original_topic": "wednesday", "comment": "Why Wenclair Doesn’t Click for Me Anymore- as a huge fan of the ship after s1 I’ve been trying really hard to figure out why Wenclair doesn’t hit for me anymore, especially because I *want* to love them the way I did back in season one. I genuinely enjoyed their dynamic at first. Their contrast felt natural, their growth felt earned, and the whole “Opessites attract” trope actually worked really well. They had softness, tension, vulnerability, and all these tiny moments that made their connection feel warm and meaningful. I really believed in the version of them that season one was building.\n\nBut after S1, something changed for me, and it’s been harder than I expected to reconnect with the ship. In season two, the relationship that hooked me just… wasn’t there in the same way. They spent a lot of their scenes either arguing, miscommunicating, or being emotionally out of sync, and I never felt like the show gave them the time to rebuild or deepen the connection they started with. Even when they *did* have an emotional moment, like right before switching their bodies back, it didn’t carry that same spark or weight from S1. It felt more like a leftover of what they used to be rather than a continuation of what they could’ve become.\n\nI’m not saying the writing was malicious or that the characters stopped caring about each other, but the shift in their dynamic made it harder for me to see the romantic potential that used to stand out so clearly. Instead of growing closer, it felt like they drifted apart, and the emotional thread between them got thinner instead of stronger. And when a ship relies heavily on chemistry, softness, and contrast, that shift really affects how you connect with it.\n\nI also want to be clear: this isn’t an attack on Wenclair or the people who love it. I completely understand why the ship is meaningful to so many fans, and I think the version of Wenclair in season one was genuinely compelling. I’m not trying to take that away from anyone. I’m just being honest about my own experience: after S1, the show didn’t give me the same feeling or energy that originally made me see their relationship in a romantic light.\n\nThe frustrating part is that I *wish* I still shipped it. I wish I could recapture that spark I felt the first time around. I wish I could go back to seeing what everyone else still sees. But the shift in how they were written in S2 changed the way I interpreted their dynamic, and no matter how much I try to get that old feeling back, I can’t force it.\n\nSo this isn’t a hate post, or a dismissal, or some superiority compex thing. It’s just me admitting that the version of Wenclair I connected to isn’t really present anymore, at least not for me. And I really wish that wasn’t the case.", "timestamp": 1763758921, "label": "1"}
{"original_topic": "wednesday", "comment": "Based on your current phone battery and birth month, what are your weekend plans?", "timestamp": 1763758921, "label": "0"}
{"original_topic": "euphoria", "comment": "Hunter Schafer reminds me of a Young Claire Danes Hunter Schafer reminds me of a young Claire Danes — that same translucent fragility paired with an undercurrent of steel. I think San Levingston must have thought the same thing when he dressed her as Juliet from Baz Luhrmann’s 1996 remake. The resemblance wasn’t just visual; it was tonal. That soft, celestial innocence framed in something bold and cinematic. Angel wings, whiteness, a kind of luminous melancholy that feels unmistakably Juliet.\nAnyone else catch that? Or was it just me having a déjà vu flash of Claire Danes drifting through that party scene like a heartbreak waiting to happen?", "timestamp": 1763758921, "label": "1"}
{"original_topic": "euphoria", "comment": "S01E03: I thought both Cal—at the carnival—and Nate—at the lake—were going to kill Jules if she had refused to comply, is it possible that Cal would have killed her?", "timestamp": 1763758921, "label": "1"}
{"original_topic": "euphoria", "comment": "Bitch you are my soulmatee", "timestamp": 1763758921, "label": "0"}
{"original_topic": "euphoria", "comment": "How to have a Euphoria style month? December is approaching. And it is a month that reminds me a lot of the series because the first time I saw it was around this same time of year, in addition to the fact that the first season is temporarily located in the last months of the year.\n\nSo, I'm looking for a way to make December a “euphoria” month. I don't know, let my life feel like that for a moment. As if I were a character within the series. But without the drugs hahaha. I think it would be fun to get out of my comfort zone.\n\nYo sé que adoptar un “euphoria lifestyle” es algo que algunos han intentado también.", "timestamp": 1763758921, "label": "1"}
{"original_topic": "euphoria", "comment": "Nate was right and it’s not even 10 years yet Nate: That's probably why you're spending all your time with someone who's going to leave you and won't even remember who the fuck you are in 10 years.", "timestamp": 1763758921, "label": "1"}
{"original_topic": "euphoria", "comment": "Sydney was on this sub! 🤣", "timestamp": 1763758922, "label": "1"}
{"original_topic": "euphoria", "comment": "do you guys think this new religion aspect will ruin the appeal of the show? i made a post about this a couple days ago and it seems like most of the people in this sub are not religious or said they would drop the entire season if it was about religion.", "timestamp": 1763758922, "label": "0"}
{"original_topic": "euphoria", "comment": "S2 e5 I’m kind of really annoyed like Jules went and told rues mom about the drugs \nA:without thinking of any of the consequences (like drug dealing can put you in so so much harm) and she didn’t think about any of that \nB: so she’s aloud to go and sh without her dad finding out but I’m sure she’d be just as pissed if rue went and told on her.", "timestamp": 1763758922, "label": "0"}
{"original_topic": "euphoria", "comment": "I ❤️ her", "timestamp": 1763758922, "label": "1"}
{"original_topic": "euphoria", "comment": "I love it when she does that", "timestamp": 1763758922, "label": "1"}
{"original_topic": "euphoria", "comment": "Manny Santos walked so that Maddy Perez could serve and leave no crumbs They are the same, here me out!\n\nManny is Maddy TV MUTHA!\n\nManny was abused by a boy her age (Peter), had a backstabbing blonde best friend (Emma) who also hooked up with the guy that hurt her. Both loved and cherished their friends and tried to help them get off drugs. They were also cheerleader. Both were fashion divas who could whoop a bitches ass and\n\nManny from Degrassi walked, so that Maddy could eat and leave no crumbs.", "timestamp": 1763758922, "label": "1"}
{"original_topic": "euphoria", "comment": "I want to see memes from East Highland students after Lexi's show Let's imagine that East Highland has an Instagram account for memes, or class or inter-specialty groups, on WhatsApp or elsewhere. \nGiven the number of people who were present at Lexi's show, which we can say revealed all the secrets of Maddy, Kat, Rue, etc group, It's possible that people were still talking about this show in the weeks that followed\nGive me examples of the same typical comments that East Highland students would make about the show, like POV Kat, POV Cassie, etc...", "timestamp": 1763758922, "label": "0"}
{"original_topic": "euphoria", "comment": "Maddy Perez or Adrian Lee", "timestamp": 1763758922, "label": "0"}
{"original_topic": "euphoria", "comment": "fez/angus cloud in season 3 how does everyone think they’re going to address angus cloud’s passing? we lost ash tray at the end of S2, but is there a chance we could get “flashbacks” of fez? some unused footage? obviously they can’t just pretend he was never in the show, there’s the time jump.. but will they try and play it off like he’s in prison, something happened after ashtray was s*ot? i’m just so interested, especially with lexi too, as they were basically about to get together?\n\n\nif anyone has any sources that have mentioned what/if they plan to address that’d be helpful, just such a bittersweet feeling knowing a huge corner stone of the show won’t be there, RIP angus cloud.", "timestamp": 1763758923, "label": "1"}
{"original_topic": "euphoria", "comment": "S2e2/3 recap straight up didn't happen? Hi all, I'm watching for the first time so apologies if this is explained later but I didn't want to risk spoiling myself. I just finished s2e2 and moved onto e3, but the recap was instead showing the resolution of all the plotlines that were only just established? Is HBO missing something or am I?", "timestamp": 1763758923, "label": "0"}
{"original_topic": "euphoria", "comment": "BB Unpopular opinion but I kind of wish they went more into BB’s story like I’m she’s a side character I’m just interested in what she had going on in her life..", "timestamp": 1763758923, "label": "1"}
{"original_topic": "euphoria", "comment": "If You Know, You Know: Why Labrinth's Score Lives Rent-Free in Our Heads. \nhttps://reddit.com/link/1p117dy/video/a2i9qt2yw52g1/player\n\nThat *Euphoria* score is an absolute banger. I swear it just hits different every time. I wasn't ready for that pure cinematic nostalgia—it's a whole mood. I'd pay good money for a memory wipe just to get that first-listen vibe check again. Take my upvote, Labrinth! 🤯🎧✨", "timestamp": 1763758923, "label": "1"}
{"original_topic": "euphoria", "comment": "Just finished watching the series for the first time All I can say is wow. Season 1 was one of the best seasons of a show I’ve ever seen. Everything just felt perfect from the storylines to the acting to the music placements. Just perfect omg", "timestamp": 1763758923, "label": "0"}
{"original_topic": "euphoria", "comment": "Rate my quick pen sketch of Hunter Schaefer", "timestamp": 1763758923, "label": "1"}
{"original_topic": "euphoria", "comment": "Nate &amp; Jules/Cassie/Maddy ok, so I'm reading some of the comments where people think Nate will end up with Jules and that will be part of a his redemption arc. so you guys really think that he will end with someone his dad f\\*ced? that is not redemption, that's f\\*cked up. imo their storyline ended in s2 in Nate's truck.\n\ni'm also reading that Nate and Cassie get married in s3. also not redemption. why would he do that, after turning her down in s2?\n\nimo he belongs with maddy, but I also kinda get that she's probably moved on after 5 years. in s1 finale kat says that \"nate and maddy will probably divorce 3 times, and somehow live a happy life\" and I can't unsee that.", "timestamp": 1763758923, "label": "0"}
{"original_topic": "euphoria", "comment": "Euphoria really destroyed its potential Hey y’all, so I was bored and decided to rewatch Euphoria, and dang guys season 1 is literally so peak. I really feel like Euphoria stands out from all these other high school dramas because the aesthetic and cinematography is just beautiful, not to mention that I also feel like the characters are super realistic (not so much the whole high school aspect because every one of these bitches would be dress coded in two seconds if it was the real world lol) but just the way the characters think and feel, I mean I’m in college now but when season 1 first came out, I was a sophomore in high school and the characters were just so relatable to me.\n\nBut I’m not gonna lie, Euphoria really just wasted away all of its potential with season 2 and how they’re treating the release of season 3. First of all, season 2 was lowkey trash. There wasn’t much in the way of character development or just overall storyline, and after rewatching season 2, it really just feels kind of dragged on. When the hype was going on for season 2, people treated this show like it could do no wrong and so did I, but now I really just feel like season 2 is pretty bad. Lexi’s play was also so unnecessary, like I get that they were trying to show how she was coming out of her shell and stuff, but I feel like they could have done that in a much better way, we as the audience really didn’t need a whole recap of the events of season 1 in a school play that would have never been allowed to exist in a real school. Outside of just the writing though, I mean these people have waited SO LONG to release the next season, it’s gonna be 4 years by the time the new season comes out. I know there were unexpected deaths from the cast which is just a tragedy, but it’s been so long and there’s so many people missing in the show now that I feel like people aren’t even excited about this show anymore, and they should lowkey just call it good, but of course they’re gonna milk it financially for all that it’s worth. It just kind of sucks because season 1 had the potential to make the show the best modern teen drama ever made, yet it failed so miserably.", "timestamp": 1763758923, "label": "0"}
{"original_topic": "euphoria", "comment": "Spoiler I genuinely hate Jules. If you watch the whole thing and don’t agree how not?? All she did was seek any type of validation from ANYONE. She was a whore in my opinion. Especially what she did with Elliot but acted like RUE had feelings for HIM. Everything to do with her has to benefit her.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "euphoria", "comment": "Nates Dad repressed homossexuality led Nate to turn into Frankenstein Hey,\n\nCarl Jacob (Nates Dad) said that is unsolved internal issues, such as repressed homosexuality let him poison everything around.\n\nDo you guys think that the repressed homosexuality of Nates Dad, led Nate into turning into Frankenstein? It was so much that he just transformed.\n\nI can´t wait for the S03 with Nate being Frankenstein.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "euphoria", "comment": "S1 vs S2 screentime differences Rue - S1: 3 hours and 27 minutes vs. S2: 3 hours and 18 minutes   \nJules - S1: 1 hour and 52 minutes vs. S2: 1 hour and 24 minutes  \nNate - S1: 1 hour and 18 minutes vs. S2: 1 hour and 35 minutes  \nCassie - S1: 1 hour and 12 minutes vs. S2: 1 hour and 35 minutes  \nKat - S1: 1 hour and 10 minutes vs. S2: 1 hour and 4 minutes  \nMaddy - S1: 1 hour vs. S2: 1 hour and 26 minutes  \nLexi - S1: 41 minutes vs. S2: 1 hour and 42 minutes  \nCal - S1: 36 minutes vs. S2: 31 minutes  \nFez - S1: 27 minutes vs. S2: 1 hour and 9 minutes", "timestamp": 1763758924, "label": "0"}
{"original_topic": "euphoria", "comment": "Why is Jules’ storyline being kept so under wraps for Season 3? Is there a reason Jules’ Season 3 storyline seems to be the most tightly protected one in the press/leaks? We’ve gotten leaks and hints about everyone else, but her story is totally hidden.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "My best Friend walks around like this 24/7. It's giving me costum vibes tho. What do you think?", "timestamp": 1763758924, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I’m the oldest - CLEARLY.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I miss the grounded and realistic tone that the early seasons had I’ve rewatched the entire show many times at this point and the more often I do, the more often I find myself gravitating towards the earlier seasons. I think there’s something about them where the characters just feel more “real” and the dramatic stakes feel more relatable overall.\n\n\nWhen you analyze it, the first two seasons are about an illegitimate businessman trying to raise both himself and his dysfunctional family through the criminal underworld of the early 20th century. Their goal is to simply survive in this society.\n\n\nIn Season Three, the focus becomes more worldly and grand in scale. Tommy begins doing secret diplomatic missions for the British intelligence service and international diplomatic relations are at play. The Season Three finale ends with a large action set piece involving a train chase and explosives. Contrast that with the previous two finales where main characters simply get shot.\n\n\nAlso before people inevitably start accusing me of “hating on” the later seasons. No, I don’t hate them. I enjoy the later seasons, especially Season Three and Five. I think they both do a great job of telling a political narrative while keeping the tone grounded and suspenseful. The finale of Season Five is so simple and yet grips with tension.\n\n\nWith the movie coming out soon and the story of it once again involving Tommy doing secret agent James Bond esque missions for Churchill in the middle of a World War. I can’t help but hope that they don’t forget about the smaller character moments. Peaky Blinders is at its best when it focuses on the individual, real world emotional drama of its characters. And it can be easy to lose that when the stakes are so grand.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Ada is underrated I’m watching the series for the second time. And I’ve finally gotten to season 6 and I have to say Ada is written so well. I didn’t give enough appreciation to her character the first time around. Her character development is really quite fascinating to watch. Starting out as a communist to widow to political advisor and major entity in the Shelby company. She is strong willed, intelligent, and not afraid of Tommy which I love. She is also super kind and loving to her family and the men she deals with. Despite not always being directly involved in every episode the actress always nails her performances. Her character is essential but sometimes unassuming. \n\nThis thought really came about because I’m watching the interactions between her and Lady Diana and it’s incredible to watch. She is witty and sarcastic enough to keep up with the “digs” from Diana. But still remains loyal to her roots. I love that she dresses so well and is threatening without ever doing too much.  I just have to give my props to this character and the actress. So well done.", "timestamp": 1763758924, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "The moment he looks up and looks at the camera, the lyrics of the song say:\"you know\u2028 you’re never coming back\" 💔 And this is so sad : Knight also referenced his relationship in the Esquire interview, telling fans why Grace had to be killed off. \n\nHe said: “It was tempting to give him that sort of happiness with Grace. But I just think if he ever finds happiness and contentment then the thing that makes him extraordinary will probably go away.\"", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I love this picture!!", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Paul Anderson seemingly confirms he will be in new peaky blinders movie", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "His shadow os cast wherever he stands", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "What is the sexiest scene in Peaky Blinders for you, personally? I'm intrigued ;)", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Arthur Shelby makes an appearance in the new stadium announcement video for Birmingham City", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Hope this hasn't been done before", "timestamp": 1763758925, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "That's it. That's the post.", "timestamp": 1763758925, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "..He used to be the guy from 28 days later, not anymore.", "timestamp": 1763758926, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "Season 3 ending ( Deal with Tatiana ) So we saw at the when she said \" you would never steal from your family would you mr shelby ? \" \n\nIt just occurred to me, did they make the deal on tommy's wedding night itself? because at the end of that ep , tommy told polly he's going to steal. \" i'm a gambling man \" when polly asked if he would risk it all. so she was the one who suggested it. and all this while....he made a promise to grace...a vow ...to stop al this business. what do you guys think", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Peaky Blinders x Snowfall I am watching Snowfall right now and I'm still on Season One, after I've finished Peaky Blinders, and it has my mind thinking. Snowfall starts in 1983 and we know there'll be more Peaky Blinders stuff after the movie, in 1953; so hypothetically if a Shelby descendant of Thomas and the gang moved to Los Angeles, and started their run against Franklin Saint - how do you envision that? Considering this Shelby is like Thomas and the family, how would they play Los Angeles out? Because I have so many different scenarios going through my head right now.", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "The most underrated villain who probably got the closest to killing Tommy In season 2 final scenes of ep 1, Sabini almost kills Tommy because he probably had underestimated the guy, Sabini was surprisingly smart, and got to Tommy before he even had a change to meet with Alfie and nearly killed him, Tommy was only saved because of the unknown fact that at the time he was being watched by Major Campbell and his men, the only thing that saved Tommy's life.", "timestamp": 1763758926, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "Every Obe Crossover 👿", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Bennu is hooked on season 5 She’s enjoying the new Arthur storyline", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Everything that came out of Billy Kimber's mouth made me laugh", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Jack Nelson's Agenda Why was Jack planning to kill Thomas? Tommy was Jack's bridge to all the powerful people in Britain, he offered to spy on Churchill, Jack allowed him to export Opium to America, he clearly liked Tommy's character and expressed multiple times how they are similar people. Why then was he planning to kill Tommy Shelby? Is the answer clarified in the series or will we see the reason in the upcoming movie?", "timestamp": 1763758926, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Tommy Shelby's character Do you think any other actor could pull off Tommy Shelby in Peaky Blinders, other than Cillian Murphy? What would be your Top 2 picks?", "timestamp": 1763758927, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "..Best man!", "timestamp": 1763758927, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Can someone explain the 5 tons of opium? We know Chang had the opium.\nWe know Thomas agreed to move the opium.\nWe know Arthur fought off an attack for the opium.\n\nWhat happened to the Chinese and how did Thomas end up in total control of 5 tons of opium?", "timestamp": 1763758927, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Tommys \"confession\" season 3 I was just thinking about the scene where Father Hughes forces Tommy to tell the Russians he was wrong/lying about Hughes. This comes after  tommy was severely beaten and left without medical attention. It looked blatantly coerced, is there any way for Hughes to look more guilty than to bring Tommy in on deaths door to confess. Even with zero context it looks like Tommy is not admitting he was wrong but was forced into saying something.", "timestamp": 1763758927, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "I love this scene 😂", "timestamp": 1763758927, "label": "1"}
{"original_topic": "stranger_things", "comment": "What are some good episodes to watch, in place of a total rewatch? Preferably in chronological order.", "timestamp": 1763758927, "label": "0"}
{"original_topic": "stranger_things", "comment": "How can we get Netflix House to do a live premiere event for Stranger Things Season 5 premiere?!?! Netflix House just opened in Philadelphia! The Netflix inspired destination an eatery, game room, shop, immersive experiences and a THEATER! \n\nHow can we set up a popup event for Season 5 at the only Netflix live venue?!?\n\nWho else would like to go to an event like this?  I’m hoping through enough likes, shares and comments there will be enough interest to spark a popup event.\n\nIs anyone aware of any other unofficial live events for Season 5?", "timestamp": 1763758927, "label": "1"}
{"original_topic": "stranger_things", "comment": "has anyone been dissapointed after playing the new fortnite stranger things map? i was so excited about this collab but i’m so dissapointed with how much they did with it, first of all it’s only a blitz map, yet there’s an anyone BR map for the simpsons, the main problem tho is that it doesn’t actually look like hawkins, it’s just fortnite style buildings with vibes. just imagine if they actually made a full size stranger things map with realistic locations like the lab and star court mall, and they could’ve even included the tunnels for underground transportation, i can’t believe how badly epic games fumbled with this", "timestamp": 1763758927, "label": "0"}
{"original_topic": "stranger_things", "comment": "Handmade Byers living room with garlands out of cardboard from Stranger Things Netflix series Everything is completely handmade: cardboard, paper, acrylic paints, wooden sticks — no fancy materials, just patience and chaos 😅\n\nFull creation video (tutorial) https://youtu.be/VDO1rk3vqdA\n\nTotal budget ≈ $32.70 I spent 10 days making this.\n\nI’m Vlada, and I create cardboard miniatures — from Hogwarts and Harry Potter, to SpongeBob’s pineapple house, Patrick, and Squidward, to the Mystery Shack from Gravity Falls, The Simpsons, and many more iconic worlds!", "timestamp": 1763758928, "label": "0"}
{"original_topic": "stranger_things", "comment": "Unnecessary Plot Did anyone feel this was unnecessary plot or was underutilized character?", "timestamp": 1763758928, "label": "0"}
{"original_topic": "stranger_things", "comment": "The lost sister. Upon doing some research i now know that this is a somewhat singular episode.  But years ago I loved stranger things season 1 but can't remember why I never finished season 2. I remember now I stopped at season 2 ep 7 ( the lost sister) i found this episode so bad I lost interest in the whole show. Only to find out now it was just a single episode like this. \n\nI need to learn patience for sure but how silly putting an episode like this in it. I also guess lots of people have an issue with this episode.  The unfortunate thing is also that I didn't find season 2 that interesting. Should of stuck with it.", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "Lego Stranger Things Season 3 (Top Row) L to R: Jonathan, Nancy, Hopper, Joyce, Murray\n\n(Middle Row) L to R: Robin, Steve, Will, Mike, Lucas\n\n(Front Row) L to R: Erica, Dustin, Eleven, Max, Billy", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "JUST 5 MORE DAYS 🔥", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "Wills painting (interesting) Will painted a painting for Michael Wheeler in the hit TV-show Stranger Things Season 4 now streaming on the very popular (Glinda Approved) streaming service Netflix. I believe he painted rainbows showcasing his queer identity and his romantic feelings towards Mike. Eleven Eleven Eleven \n\n\n\nEleven", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "Inconsistencies between first shadow and the series I recently saw the play on Broadway and then decided to have a rewatch of the whole show. Here’s things I noticed with the play in mind while rewatching. \n\n- when Karen talks about getting married to Ted she says “he was older” (in a way that suggests a few years older) but in The First Shadow they’re the same age and got together in high school\n- Bob says Joyce didn’t even know who he was in High School… pretty sure she’d remember a kid she spent a very significant and absolutely terrifying night with hunting the Hawkins cat killer\n- there’s a patty working at Hawkins Lab (s2e1), singled out and mentioned by name \n- vecna’s clock chime can be heard in s2e4 when hopper finds the underground tunnels. \n-S4E9 Vecna says that the place eleven banished him to was “a new place”… but in the stage play we learn he has been to dimension X before. \n\nI think most of these are mistakes/coincidents seeing as they just didn’t have the Creel storyline mapped out early enough. But some of them could also be more meaningful? Keen to hear if anyone got a theory based on one of these.", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "\"King\" of the Upside Down? Hi everyone! I want to pose a question as i've seen people with different opinions argue about this topic and i'm curious.\nSPOILERS: i want to make sure i don't ruin the fun for anyone so if you haven't watched season 4 don't continue reading.\n\nWho would you think is the king/leader/thinking mind of the Upside Down?? Some say it's Vecna, others say that it's the Mindlflayer controlling Vecna.\nFor me it's clearly Vecna, we know that Henry entered a strange dimension when Eleven \"killed\" him, the Mindflayer was already there but it was Henry who shaped him (therefore connecting himself to the hive mind and gaining control of the creatures there) and the dimension into the world he desired. So it's ultimately Vecna the one who controls everything that happens in the Upside Down, including the actions of the Mindflayer in season 3.\nThe way I view it, the Mindlfayer is a tool for Vecna to use, not an independent creature (maybe it is but it's manipulated by Henry who knows).\n\nI'm interested in what the people that think it's the other way around have to say!", "timestamp": 1763758928, "label": "1"}
{"original_topic": "stranger_things", "comment": "I really hope they drop the Nancy, Steve, Jonathan love triangle subplot and focus more on the their individual characters, giving them a way to move on. Nancy is a badass and the dilemma in the love triangle is holding her back. Same goes for Steve and Jonathan too.", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "Robin was kinda the MVP of early S4 I'm re-watching the show in preparation for the final season, and I realized how a lot of the big breaks in the first four episodes are at least partially attributable to Robin. In order, she:\n\n  \nHad the idea to look up all the Ricks' memberships at Family Video, which led the group to Eddie,\n\n  \nSuggested to Nancy to search through the Weekly Watcher, which had Victor's demon attack story,\n\n  \nConvinced Hatch to let her and Nancy talk to Victor, and\n\n  \nFigured out the music connection which saved Max's life.\n\n  \nJust something I noticed that I don't think I've seen brought up.", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "Real life STRANGER THINGS Facility EXPOSED | Anneke Lucas Incredibly - Stranger Things wasn’t just a work of fiction. It was based on a real life mind control facility, which Anneke Lucas was taken to as a child. Through the torture She developed psychic abilities and ability to put thoughts in other peoples heads! 🤯🤯🤯", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "How often do you pet the intro music play? It’s a good tune. But I skip it most of the time. If I am binging I skip it every time, but if I’m just catching a few episodes here and there I might let it play.", "timestamp": 1763758929, "label": "0"}
{"original_topic": "stranger_things", "comment": "Scarier Vecna", "timestamp": 1763758929, "label": "0"}
{"original_topic": "stranger_things", "comment": "This dynamic is all I really wanna see from season 5. All over The net all I've seen is \"Byler\" this \"Mileven\" that.... \n\n\nBut what I'm most hopeful to see is these two finally interacting in a significant way. And to see if their relationship has at all grown.\n\n\nOf all the dynamics between characters missed opportunities etc The fact that Of everyone of the characters these two have barely shared any screentime or significant meaningful moments together is one I find the most baffling.\n\n\nEl risked her life to save Will Byers multiple times. Sensed him in the Upside Down. And did everything she could to reunite him with his friends and family. \n\n\nIn season 2 she states to Joyce she saw his suffering from the Mind flayers possession and closed the Gate saving his life and freeing him. \n\n\nAfter all that you would think these two would strike up some kind of friendship. Or meaningful dynamic. However the two barely interact. Even after Hopper's disappeareance and El's subsequent Adoption by Joyce. \n\n\nThe two go to school together, seem to get along for the most part but still no real sign of significant development in their Relationship. (Not even taking into account Will's feelings for Mike, as one could argue it's a contributing factor in Will seemingly being distant from El) \n\nWill does seem to feel bad for El experiencing bullying and offer to help fix her project. \n\n\nHowever afterwards there's some tension between them over Mike's visit. Again we aren't focusing on that.\n\n It's only after El is taken by Brenner that I think we begin to see Will really step up &amp; take some initiative to find her apart from Mike. Notably doing what he can to reassure Mike the whole time &amp; Straight up calling her Family and his sister even when \"Johnathan addresses her as \"Step sister \".\n\n\nIn these moments &amp; upon reuniting with El we finally see El and Will have a significant emotionally charged interaction. As they hug and Will tearfully asked if she was ok clearly relieved to see her. \n\n\nWill also is instrumental in motivating Mike to speak from his Heart to save her from Vecna. Another moment where Will stepped up for El. (Putting his own feelings aside for her safety in these moments may be his way of returning the favor )\n\nSo more than anything else next season I need to see this dynamic become more fleshed out. I think it's  long overdue that These two characters given everything they've been through together really feel like they've reached a point where they truly have become close friends who Have each other's backs. Will maybe even  thanking  El for Saving him before.\n\n\n\nI also think it's time for Will to step up this season and get angry if you know what I mean. The Mind flayer, Vecna, and The Upside-down has ruined his entire life and hurt everyone he cares about. It's time he was the one to fight back and say \"Enough\"! \n\n\nBut what do you guys think? Do you guys wanna see Will and El become closer in season 5?", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "Anyone see these popping up anywhere? Upstate NY for context.", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "Why do people hate the Russian prison plot of season 4? I’ve been seeing a lot of hate for it online recently and I don’t understand why. Personally, it’s my favorite plot of the season. I enjoy the other stuff too, but I’m always waiting in the back of my mind to go back to Hopper, Joyce and Murray.", "timestamp": 1763758929, "label": "1"}
{"original_topic": "stranger_things", "comment": "Mind Flayer leaf! Currently rewatching before Wednesday and my Mind Flayer anthurium decided to be extra festive and put out this giant new leaf!", "timestamp": 1763758930, "label": "1"}
{"original_topic": "stranger_things", "comment": "Never realized Dustin actually had a dad in the first season…", "timestamp": 1763758930, "label": "1"}
{"original_topic": "stranger_things", "comment": "What’s your dream S5 Soundtrack? So after the Duffers excitement about the song that they were somehow able to get licensed and include in the season from an artist that has never licensed for TV, I decided to try and maybe find it or some options. \n\nI began by searching the [1986](https://en.wikipedia.org/wiki/Billboard_Year-End_Hot_100_singles_of_1986) &amp; [1987](https://en.wikipedia.org/wiki/Billboard_Year-End_Hot_100_singles_of_1987) Billboard Top 100 against TuneFind’s artist searchable database to see the artists credits and who or even what song hasn’t licensed.\n\nSo far I’ve only come across 2 artists and 3 songs all of which I can’t quite see fitting either the show or the brother’s excitement about this get. \n\nThey are: \n\n**LIsa Lisa and Cult Jams - ‘Head to Toe’ &amp; ‘Lost in emotion’** \n\n**Gregory Abbotts - ‘Shake you Down’**\n\nSo I’ve finished those 2 lists, my husband I then started searching popular songs of the time from memory (yep I’m that \nold and I grew up in the genre) and so far nothing. \n\nNeedless to say I’m definitely in need of some suggestions to search but also wondering…..\n\nWhat are your favorite mid-late 80’s bangers you’d love to see scoring a badass battle scene or maybe even a more ballad type song you can hear scoring a romantic moment?  \n\nNaturally the series is gonna include various songs. I’m hoping more than any season so far to be honest. \n\nSo why do you think the song could be and what would you like to hear?", "timestamp": 1763758930, "label": "1"}
{"original_topic": "stranger_things", "comment": "Does anyone else feel like Lonnie is a wasted character? Probably already discussed but i really wish he was kept in the story just to give Jonathan more to do, exploring their failed relation seems way more interesting than making Jonathan a junkie.\n\nDon't get me wrong, i don't need another redemption arc, but i feel like if Lonnie was kept in Jonathan could probably have one of the best arcs in the show doing justice to his depiction in S1.\n\nEDIT: You guys are putting way too much emphasis on me calling Jonathan a junkie, you get my point.", "timestamp": 1763758930, "label": "0"}
{"original_topic": "stranger_things", "comment": "I’m really curious how big the cliffhanger on episode 7 is before the finale It’s gotta be big, I know those couple of days between episodes 5-7 and 8 are going to be CRUEL", "timestamp": 1763758930, "label": "1"}
{"original_topic": "stranger_things", "comment": "Duffer Brothers Tease 'Stranger Things' Season 5 Has the 'Most Violent Death' Yet", "timestamp": 1763758930, "label": "1"}
{"original_topic": "supernatural", "comment": "Imagine these two working a case together, I’d Love to see it.", "timestamp": 1763758930, "label": "1"}
{"original_topic": "supernatural", "comment": "What do you guys think of Balthazar? https://preview.redd.it/z6a1ifcs6o2g1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=fd4d7ebef0c44fc12923a3a93350a553a572667d\n\nDo you like his character? Do you not like him? What're your opinions on him?", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "Who can demons possess? Hello. I've been rewatching and questioned myself if a demon can possess a shapeshifter for example. He's humanoid i guess or can they really just possess humans? And if yes, where does it stop? A fortune-teller? A magician? Where's the line to unpossessability? Thanks for your answers, sorry if this doesn't fit here. \nTag season 1 because they appear from the beginning.", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "Where can I buy Spanish dubbed full series? I own all but the last two seasons on dvd and have a family member who loves the show and watched it on Netflix. But my dvds do not have Spanish. And if the show leaves Netflix, this person will no longer be able to fully enjoy the show. Where can I buy Spanish audio versions? Even if I have to purchase a region specific dvd/Blu-ray player I will. Just gotta know where I can get them.", "timestamp": 1763758931, "label": "1"}
{"original_topic": "supernatural", "comment": "Can we appreciate Cain? Can we take a moment to appreciate the hilarity of the fight scene in S9E11 where, after letting the demons Dean is fighting in, Cain is calmly flitting around his kitchen making dinner? Dean's half winning half getting his butt handed to him and Cain is just sitting there shucking corn while a demon helps themselves to a knife out of his knife block.", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "Made a poster First time ever doing it so excuse how amature and plain it looks lol. Just be gentle with criticism. I made it for a class assignment.", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "jody and donna ep 8 s 10 currently rewatching and am i the only one that ships donna and jody??? all i’ve seen is “wayward sisters” stuff but are you kidding they had helllllllaaa chemistry. maybe it’s just cause im a lesbian but there’s no way im the only one!!", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "What is your \"wasted\" potential character/storyline? So basically I wanna know what character or storyline you would've like to see more of? Personally for me Jesse Turner like where is he what happened. Also pagan gods and seven deadly sins were waisted potential since they died/were defeated so easily I guess... Anyway what's yours?", "timestamp": 1763758931, "label": "0"}
{"original_topic": "supernatural", "comment": "Dean’s tired, Sam’s angry. Love this episode, S2E3 always gets me. The fact that Dean is tired before Season 2 even ends cracks me up, since I know he’s still got 13 more seasons to go. And Sam’s face reminds me of a toddler who just had their favorite toy taken from them lol.", "timestamp": 1763758931, "label": "1"}
{"original_topic": "supernatural", "comment": "Found a little SPN reference Currently rereading Steve McHugh's \"Hellequin chronicles\", and must have missed this the 1st though", "timestamp": 1763758932, "label": "1"}
{"original_topic": "supernatural", "comment": "Christmas Card from hubby", "timestamp": 1763758932, "label": "0"}
{"original_topic": "supernatural", "comment": "Old seasons Vs New seasons Supernatural is getting taken off of netflix December 17th and I’m currently on season 7 (rewatch) and I can’t decide whether I want to skip to the good new seasons or restart the good old seasons. HELP!!!", "timestamp": 1763758932, "label": "1"}
{"original_topic": "supernatural", "comment": "Season 1 episode 6 skins Trying to watch supernatural again before it’s gone from Netflix. I am in season 2 where Dean is arrested and they mentioned the episode skins which is now missing from Netflix. Anyone know what is going on?", "timestamp": 1763758932, "label": "0"}
{"original_topic": "supernatural", "comment": "Who’s more witty or funnier?", "timestamp": 1763758932, "label": "1"}
{"original_topic": "supernatural", "comment": "Question from an outsider I've seen a couple episodes from the first season, I liked some stories but I found it to be a little repetitive and started doubting wether it has a background storyline throughout the full series. \n\nBasically is it worth watching the show even for ppl who like shows with a complex plot ?", "timestamp": 1763758932, "label": "0"}
{"original_topic": "supernatural", "comment": "Season 13 Finale I just finished the season 13 finale and I just have to rant. I know that Dean would do anything to save Sam. He has proven this time and time again. He let alt-Michael into himself, I think, because he was desperate to save Sam and Jack. But he had to know that the angel was not going to honor the deal and would take him over. Besides Castiel, they haven't had a whole lot of great experiences with angels. He seemed so surprised when Michael did what he did and I was just like, really? What did he expect? That Michael would just quietly leave at the end of that terrible fight (that fight being a discussion for another time). Lucifer is dead (maybe, who knows, the next seasons are all new for me), Dean is gone (I know he gets out of it because I hope they wouldn't beat this dead horse of a plotline for two more seasons), Jack is graceless and Sam is alone again. This series has had some high and lows but I feel like this finale was maybe the worst so far.", "timestamp": 1763758932, "label": "0"}
{"original_topic": "supernatural", "comment": "Why did the switch between Nicki Aycox's Meg and Rachel Miner's Meg work so flawlessley compared to Katie's Ruby and Gen's Ruby? When Rachel Miner showed up in season 5 as Meg, I really believed I was seeing Nicki Aycox's Meg when she was Meg 2.0\n\nGen and Katie's Rubys are just too different for me to believe that Katie's Ruby would be the Ruby we see with Gen's version.\n\nEven the actress who played Maid Ruby was more like Katie's than Gen.", "timestamp": 1763758932, "label": "1"}
{"original_topic": "supernatural", "comment": "Chronologically Sound? So I think most of you are aware that the show is scheduled to leave Netflix altogether in roughly a month.  \n\nI am running through the series, but I started about three months ago and am currently at the midway point of season 9.  What I want to ask you guys is, I won’t be able to finish the series in the time left mostly because I have a life and would need to watch multiple hours per day to finish it.  But I have heard about two episodes that not only sound super interesting, but also get great IMDb ratings that I’m really interested in watching:  “Scoobynatural“ and “Baby.”  Can I watch those right now, or at least very soon, and not be spoiling anything?  In other words, will I be able to watch it and enjoy/understand it without first burning through the series from where I am now?\n\nI appreciate the advice while avoiding spoilers from post season 9.   I’m also open to recs of other great later episodes that stand on their own, though given the time restraints I would need to be picky to weed out the lesser stuff from the great ones. \n\nAlso, one last thing; it sucks that Netflix is losing the show.  But there may be a tiny sliver of hope in that it’s been reported that Netflix is privately in communication with the owners of Warner Bros, which is up for sale.   They are interested in purchasing WB, but at this current stage they’re just feeling out their options versus other potential buyers to see if it’s feasible not only for themselves but for WB seller.  And of course, if they can purchase WB they would be outright getting the rights for Supernatural amongst their entire vast catalogue.  It probably won’t happen soon, but it could still happen.  Something to keep an eye on.\n\nI appreciate any comments about the two episodes referenced, cheers.  ✌️", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "Questing from the Occultum In season 15 when Jack visits the occultum, he speaks to the Serpent in the Garden of Eden. I'm confused. I thought the Serpent was Lucifer. If Lucifer is dead, how did Jack speak to the Serpent? Are the Serpent and Lucifer separate beings?", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "analysis on hypothetical \"irl hunters\" has anyone made an analysis on \"real\" hunters?\n\nI mean compare/contrast on how hunters would be in the real world", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "So season 6 brain thing Hello!\nJust a new little head cannon \n\nI think Sam was really harsh to Dean about having to be there, when he was trying to get back to him to save Ben and Lisa in the first episode because of him being soulless.\n\nIt never clicked in my head that he was so harsh and rude and un-Sam like because he was soulless\n\nAnd now I need someone to write a one shot about him, realising what he did when he got his soul back", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "Detroit Do people hate Detroit cuz that’s where the devil was??", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "tossed and turvy Maybe it's because I'm binging the show but has anyone noticed just how often somebody hand waves and sends our heroes flying around. I get they're doing action but tbh it really gets kinda tedious. It seems like it happens in every episode, often multiple times. just an opinion.", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "What was the point of this episode? How'd you react? https://preview.redd.it/bk5l2jm9li2g1.jpg?width=350&amp;format=pjpg&amp;auto=webp&amp;s=c1feb3c3b4035a513c95fb2c4f9acab13a8af556\n\nI still don't understand the meaning of this episode. This is season 5 episode 12 \"Swap Meat\" where this teenage boy basically used his abilities to switch bodies with Sam. I get this was supposed to be some unusual thing they haven't really experienced before, but the amount of times throughout this show when Sam's own body gets taken advantage of or violated is very unsettling. There's this episode, Azazel feeding demon blood to six-month old Sam, the woman in white basically force-kissing and abusing Sam in the pilot, Meg possessing Sam in S2E14, Ruby exploiting him with demon blood in season 4, the two hunters literally forcing demon blood down Sam's throat while physically restraining him in S5E3, that whole Becky plot in S7E8, and more. Why did the writers have Sam being constantly violated and taken advantage of and being the bigger punching bag and using them for laughs and humor? And yes, I know this show ended years ago, but still!!!!!", "timestamp": 1763758933, "label": "0"}
{"original_topic": "supernatural", "comment": "What game is Dean playing in S14 Ep17? It looks fun I might ask for it for Christmas lol", "timestamp": 1763758934, "label": "1"}
{"original_topic": "stranger_things", "comment": "A Wrinkle in Time and Stranger Things Use the Same Dimensional Metaphor Lately I’ve been thinking about something interesting: in *Stranger Things*, the Upside Down is completely frozen on November 6, 1983—the exact day Will Byers disappeared. Time doesn’t move there. The whole world is “stuck.”\n\nAnd strangely enough, this reminds me of a moment in *A Wrinkle in Time* where Mrs. Whatsit explains how you can “wrinkle” space and time—literally folding a dimension so two faraway points suddenly touch. When a dimension gets bent or torn the wrong way, a slice of reality can get trapped outside the normal flow of time.\n\nIn *Wrinkle*, a misstep in higher-dimensional travel can freeze time, collapse a world, or trap someone in the wrong dimension.\n\nThat’s basically what happens in Hawkins.\n\nWhen Eleven touches the Demogorgon during the sensory-deprivation experiment in 1983, it doesn’t just open a gate—it tears the fabric of spacetime itself. The Upside Down becomes a *frozen moment* in Hawkins history, like a page ripped out of a book and stuck on repeat. A literal “wrinkle in time.”\n\nIt's a broken timeline, trapped in the moment the tear was made.\n\nThe metaphors line up:\n\n* *A Wrinkle in Time*: a dimensional fold that collapses time\n* *Stranger Things*: a dimensional tear that freezes time\n* The Upside Down: a world suspended in a single day\n\nThe more I think about it, the more it feels like the Upside Down isn’t just parallel—it’s stuck in November 6, 1983, because the original breach ripped a hole in the flow of time itself.\n\nKind of wild how two completely different stories end up saying the same thing about higher dimensions and broken timelines.", "timestamp": 1763758970, "label": "0"}
{"original_topic": "stranger_things", "comment": "Why do you Steve fans want him to be second best? He's always second to Jonathan for Nancy's feelings. Be it second season or now if that's the case.", "timestamp": 1763759409, "label": "1"}
{"original_topic": "stranger_things", "comment": "I only watch season one and I’m going to jump straight into season 5💥 Promos have enticed me to watch again especially the “most visceral death” tip, surely there isn’t anything crucial I missed right?", "timestamp": 1763759409, "label": "1"}
{"original_topic": "stranger_things", "comment": "For y'all in NYC, I'm hosting a b*tchin' dinner + private cinema screening for the first two episodes! Not sure if posting the link to the event signup is allowed buuuuuuut here's the [Partiful](https://partiful.com/e/0jnXw1bd5XZ4NNwLYV6Z) for the event! \n\n  \nHere are the details:\n\n* Date &amp; time: Wednesday, Nov 26th 8pm\n* Location: Chelsea\n* Open spots 4-16 (may downscale to a smaller room)\n* Included: Dinner + screening of first two episodes\n* Price $150 per person.\n\nLet's get smackin'", "timestamp": 1763759410, "label": "1"}
{"original_topic": "supernatural", "comment": "That jarring restart feels I first watched Supernatural last year, knew about it when it came out through a friend but didn’t get into it. \n\nI lost interest by S14E16 end as it was just talking and talking about feelings and some crazy power increases Restarted 3-4 months ago before I knew it would be taken off and I finally finished it now. Stuff like fighting god, it was a hilarious premise and also god being the only reason they even did anything felt very bad. I was with Dean - yeah, we need to take down this guy, don’t care if he is god 😂 Felt so sad when it got over, not due to their ending, just that the show ended. No more baby, no more Dean and Sam and Cass.\n\nSo next day I restarted again 😂 And oh boy does it feel so jarring but in a great way to restart from the beginning. From the colors to the story, different types of roles they took on ie wildlife guys, homeland security. By season 14, I didn’t bother about either dying but wow in season 1 you really feel the pinch and worry what might happen (even if you have finished the show)\n\nWho else is restarting?", "timestamp": 1763759411, "label": "0"}
{"original_topic": "stranger_things", "comment": "Stephen King Connections New to Reddit and fairly new to stranger things. Have no one else to geek out with, so thought I’d give it a go here. You can make fun of me, but I’m not crazy familiar with King, only the most popular works like It. But a few fun things I wanted to check on, was the Creel house inspired by the Neibolt house? And is Vecna inspired by Pennywise, utilizing people’s greatest fears and trauma? The scene where Fred has people chanting “murderer” at him in the woods was very reminiscent of a Stephen King scene to me. Just curious what your favorite connections are, and please share any and all connections that you guys love! I’m sure my connections are super surface level, I’m not crazy versed in any of these things", "timestamp": 1763759467, "label": "1"}
{"original_topic": "stranger_things", "comment": "I can't wait for Mike to be a leader again", "timestamp": 1763759528, "label": "0"}
{"original_topic": "adolescence", "comment": "I've been feeling insecure lately. Do you think this hairstyle suits me? THE HAIRSTYLE IS FOR AN EVENT", "timestamp": 1763759583, "label": "1"}
{"original_topic": "adolescence", "comment": "Need advice about a boy at my school Hi,\n\nI’m a 14-year-old girl, and I’m new at my school. For a while now, I’ve noticed that a boy in my class behaves in a certain way towards me, and I’m not sure how to interpret it. Here are the facts:\n\n1. **At the beginning of the school year**, he often tried to make eye contact with me. I’m very shy, so I avoided it. Then, he started calling me *Baka* (a Japanese word for \"idiot\") discreetly, but I could clearly hear him.\n2. **As time went on, his behavior changed**. During a school trip, on the bus, he suddenly said: *\"Wesh \\[my name\\], how are you!?\"* Then, he kept looking at me. Every time I looked at him, he would look away, and when I turned back to the window, he would look at me again. This went on for a while until I got too embarrassed and turned completely away.\n3. **One day in class**, I was talking to his little sister (we’ve become friends) a bit away from the group. When we decided to rejoin the others, he suddenly rushed towards my friend, stopped abruptly when he saw me, and then went back to his friends.\n4. **His little sister told me things about him**. She said he talked about me at home, saying that at the beginning of the year, he had certain thoughts about me, but now it’s better. He also said that I was nice and that I didn’t talk to boys, which made me a \"good Muslim.\" He asked her not to tell me, but of course, she did.\n5. **One day, he asked if I was Moroccan**. I replied a bit curtly (I regret it). My friend later told me that before I arrived, he was talking to his friend about wanting to focus on his projects, but as soon as I walked in, he asked me that question.\n6. **Recently, while I was handing out papers in class**, he suddenly turned towards me and whispered something to his friend.\n7. **Another time, he asked me:** *\"Are you going to defend me at the class council?\"* (I’m just an eco-delegate and not involved in the class council). Right after asking, he left without waiting for an answer.\n\nI’m confused. He seems comfortable talking to other girls, but with me, he acts distant and ambiguous. Do you think he might be interested in me, or am I reading too much into this? How should I react?\n\nThank you in advance for your advice!\n\nAsk me questions if some points are not clear :)", "timestamp": 1763759583, "label": "0"}
{"original_topic": "adolescence", "comment": "The Growing Child: Adolescent 13 to 18 Years", "timestamp": 1763759583, "label": "1"}
{"original_topic": "adolescence", "comment": "What is Puberty? Decoding Puberty in Girls", "timestamp": 1763759584, "label": "0"}
{"original_topic": "adolescence", "comment": "All About Boys Puberty", "timestamp": 1763759584, "label": "1"}
{"original_topic": "adolescence", "comment": "Why Are Teens So Moody?", "timestamp": 1763759584, "label": "1"}
{"original_topic": "adolescence", "comment": "Adolescence  Adolescence an a period of fear and a need for information for a person going through it. Many questions arise whether the changes are normal or a form of abnormality.  Despite the fear tiu may have this is perfectly normal. Your body is just preparing for adulthood. With all these changes happening it's better to ask questions and get the information needed because this calms the mind and reminds you that you are not alone. So dont be scared but embrace the changes.", "timestamp": 1763759584, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Jesse is not a victim This is something I've been wanting to talk about for a while now, so here goes. I honestly don't understand the whole victimization of Jesse in this show. I agree he suffered some horrible stuff throughout the show, but let's not pretend Jesse's not screwed up so many situations. He led Hank to the RV, he got high with Jane which caused Walt to miss his child's birth, he spent Walt's money on hookers when it was supposed to be spent for buying an RV, and the stupidest of all, attempting to kill the two drug dealers. I can go on and on about this. He is not innocent! This is contradictory to a comment I made on an earlier post, where I stated that he had a stronger moral compass, but that doesn't mean he's a good guy lol. At the end of the day, the guy is a murderer, a guy who tried to sell meth to recovering addicts, and a guy who cooked meth. Simple as.", "timestamp": 1763759585, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Ironically, Walter suffered for the things he didn't do. Aside from the obvious main point—being the biggest methamphetamine dealer in Latin America and a mafia boss—the things that REALLY setted his end, were supposedly killing Hank, hiring a guy to kill Jesse and manipulating and abusing Skyler for his own benefit—the only things he didn't do.\n\nNothing about Brock, nothing about continuing in the business even when he didn't need to, nothing about Jane, nothing about denying the financial support of his former friends. The worst things that fell on his conscience were the ones he didn't do.\n\nIt shows how he completely lost control of the consequences of his actions. I confess I felt sorry for him in the scene where Walter Junior blames him for Hank's death (not because he's a poor guy, but because he genuinely tried to save him).", "timestamp": 1763759585, "label": "0"}
{"original_topic": "breaking_bad", "comment": "I know I’m gonna seem super slow for saying this but I just realized the parallels between these two &amp; it’s amazing. Honestly I don’t think my interpretation is beyond surface level because I’m pretty sure anybody more developed than me could already see it for what it is lol but it’s just so amazing that do these two not only kill someone back to back (episode wise) but both parties have opposite reactions to it. Walt has to save Jesse’s life and basically doesn’t hesitate once he realizes what needs to be done (I think personally at the dinner scene before leaving you can see he was visibly angry, if anything just as angry as Jesse was) and kills without a SECOND thought. Next episode Jesse has to kill Gale but unlike Walt, as soon as the realization comes to the surface there’s not only extreme hesistance but it’s for a good moral reason; Gale is still innocent so there *has* to be another solution, right (as opposed to Jesse’s firm stance that the dealers needed to die for what they were doing and ended up doing in the end)? Jesse does end up doing what he has to do, but you can see the man’s actually tore up about and I suppose if we want to take it further than these two episodes Walt has no remorse for Gale while Jesse does but they both have no remorse for the dealers that got killed.\n\nAlso side note, it’s sort of unrelated, but sometimes I think of how in season 1 episode 3 when they knew what had to be done to Krazy-8, Walt was very hesitant on doing so &amp; was crying at the end like Jesse while Jesse was very insistent (to be fair though, the coin flip **is** sacred).\n\nI really like this show.", "timestamp": 1763759585, "label": "1"}
{"original_topic": "breaking_bad", "comment": "First rewatch in a while...pilot episode: I just rewatched BCS, and why not, go back to BB. Why did I not catch Walt positioning a weapon to his head to off himself in the very first episode?? It's there, he pulled the trigger, clearly didn't fire, otherwise there'd be no story. \nWas he always suicidal, esp after the diagnosis? A friend once said, the most selfish thing you could do is suicide. Now do I have more perspective with Walt's selfishness as I rewatch?", "timestamp": 1763759585, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Just finished watching for the first time What an amazing show. The writing and acting were incredible. Conflicting feelings about the characters and who to root for and despise. Incredible tension and unpredictability. \n\nPoor Hank and Marie.  All of the clues were there. Saul running for his life. Gus adjusting his tie…\n\nWatched El Camino last night, glad to see Jesse get out\nWife and I agreed we need to watch something lighter and humorous for a while, then go to BCS", "timestamp": 1763759585, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How would Walt be as a scientist? Af far as I an aware, I hear that Walter dropped his PHD or something and never finished his education entirely. And that being part reason why Walt was a chemistry high school teacher and not something else involving chemistry.\n\nIf that information is correct. How would you peps estimate his apparent genius in chemistry if he had a full commitment into deeper level of chemistry?\nMight be a silt question :P\nBut I would like to hear if his passionate intellect in chemistry would bear fruit in the field. Or if he would most likely have not another Nobel prize contribution.", "timestamp": 1763759585, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How difficult would it have been for Walt to get to Gus in face off had Mike been there beside Gus ? What strategies could he have used ? I believe Mike not being by Gus’s side was a huge reason why Walt was able to outsmart gus cause he let his hatred for hector blind him to any kind of reason, which Mike would have pointed out since he doesn’t have a vendetta against hector like Gus does", "timestamp": 1763759585, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Do you guys think Mike told Gus the entire truth about what happened with gale/walt/jesse I know that in the Werner Ziegler escape there wasn’t much Mike could do but accept responsibility cause he can’t hide Werner’s escape from Gus. Just as he can’t hide gale being murdered by Jesse. But Mike not thinking things through and under estimating Walt and giving Walt the chance to contact Jesse was directly what made gale get killed. From Gus’s point of view I can see him being livid and blaming Mike entirely for what happened. Victor is an idiot and more of a muscle but Mike is supposed to be the one who’s always ten steps ahead of everyone. So do we think Mike omitted the part he played where he’s directly responsible for gale getting murdered like did he just tell Gus that while Walt was in the laundry Jesse had somehow gotten to gale and killed him? \nThere was genuinely no reason for Mike to give the phone to find out Jesse’s location cause Mike could have found Jesse all by himself without too much trouble.", "timestamp": 1763759585, "label": "0"}
{"original_topic": "breaking_bad", "comment": "\"Which Breaking Bad character did you find the most annoying?\" For me, Skyler White is easily the most annoying character. In the early seasons, she felt like a constant buzzkill, always nagging Walt and treating him like a child instead of a partner. It wasn’t just that she opposed his crimes; it was her passive-aggressive attitude and how she constantly played the victim while refusing to really listen. Then, her affair with Ted Beneke just felt petty and vindictive. On top of that, she often acted morally superior despite eventually laundering money herself. And honestly, that Marilyn Monroe 'Happy Birthday' scene was so cringeworthy I almost had to stop watching.", "timestamp": 1763759586, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Watched breaking bad 12 times now, and this is my only problem! Jesse pinkman being stupid and annoying is not cute anymore, kind of cringe, but still my favorite character.", "timestamp": 1763759586, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Walt and Jesse fighting is usually hilarious, but this scene was just depressing to watch.", "timestamp": 1763759586, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Would you consider Mike a cartel member? He does end up working for Gus Fring, someone who is tied to the cartel in Breaking Bad and Better Call Saul.", "timestamp": 1763759586, "label": "1"}
{"original_topic": "breaking_bad", "comment": "A moment no one talks about The fact Walt almost killed himself in the first episode is crazy to me. It could’ve all ended there and then, the fact he was willing to do it was the sad part.", "timestamp": 1763759586, "label": "1"}
{"original_topic": "breaking_bad", "comment": "The whole premise of this show is ridiculous. I can't get past it. It's a good show but the coincidence of how things get started is just ridiculous. Walt just *happens* to live in ABQ, which is the same town Gus Fring just *happens* to be in? And he just *happens* to have Jesse as a student, who just *happens* to end up cooking meth? Mike *happens* to move to ABQ too and *happens* to meet Gus? And Saul just *happens* to be in the city too, and they just *happen* to choose him? It's completely ridiculous. In reality these people probably would be all over the US and never even would have met each other. Every time I watch this show I can't help but just laugh my ass off at how ridiculous it all is.", "timestamp": 1763759586, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Difference in flashback scene and episode scene of the \"Willy Wonka? Walter White?\" In season 4 episode 4, when Hank and Walter are looking at Gale's notebook and he says the \"Willy wonka? Walter White?\" line, the camera pans to Walter between \"Willy Wonka?\" and \"Walter White?\". In the flashback scene, when Hank realizes that Walter is Heisenberg, the camera stays on Hank between \"Willy Wonka?\" and \"Walter White?\".\n\nWhat does this mean? Because when they are looking at Gale's notebook, the \"Walter White?\" is way more easily interpreted as a joke, in the flashback scene, Hank has a kind of suspicious look when he says \"Walter White?\". Did they not want you to think that Hank was possibly suspecting Walter a little bit? Why did they do this? Maybe this has been discussed already, I just noticed this little detail and was curious.", "timestamp": 1763759586, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Gif find Anyone got the gif of this scene when Walt walks into the home in season 5?, keep seeing it lmao and I can't find the gif for it", "timestamp": 1763759586, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Fly intro Would the episode be as bad without the \"hush little baby\" super close up of a fly intro?\n\nDefinitely not the best episode but it just starts off with a weird vibe.", "timestamp": 1763759587, "label": "0"}
{"original_topic": "the_100", "comment": "Any talented folks want to tackle a season 1 intro?      Boy would it be awesome to retroactively add in a S1 intro like the rest (man did I yell with joy the first time it played in 2x02!!)  using the best theme song in TV history 🥰 and all the S1 locations, even spoiler-y (or not) since it’s after the fact.   \n     Any graphic artist types willing to give this a shot?  Then we can all insert it into our S1 rewatches 😎😎😎", "timestamp": 1763759587, "label": "0"}
{"original_topic": "the_100", "comment": "I need help understanding this line from Dante in the middle of S2 I’m currently rewatching the series and I caught a line in Season 2 from Dante during the time Cage is trying to convince him to allow for further experimentation on the 47. When Cage takes him outside the bunker and says that he can take his suit off, Dante says “I had forgotten the smells” as he takes off his mask. I know at the beginning of the season he tells Clarke that he had been outside for 5 minutes as a kid, but he would have had to have his full suit on and wouldn’t have experienced the smells of the outside without it. What does he mean by saying that he had forgotten it?", "timestamp": 1763759587, "label": "0"}
{"original_topic": "the_100", "comment": "Books vs series I kinda wanna read the books but I know that the story is a lot different but I’m still curious cuz I wanna know if the ending will piss me off as much or if it’ll be satisfying. I’m also curious what the similarities are like the plots of each season if they’re original or based on the books. I wish that there weren’t sooo many characters that don’t exist in the books cuz a lot of em are my favorites, but I absolutely love the world building and since there’s no spin offs I’m dying to see more of this world. Anyone who’s read the books can you tell me what you think without spoiling it?", "timestamp": 1763759587, "label": "0"}
{"original_topic": "the_100", "comment": "WHY ARE THEY TAKING IT OFF NETFLIX 💔 my comfort show, i never thought i’d see the day where the little red writing appeared below the show telling me it’s leaving soon 💔 i definitely shed a tear and felt my heart break. i don’t know what i’m gonna do without my comfort show. does anyone know where else to watch it? 💔", "timestamp": 1763759587, "label": "1"}
{"original_topic": "the_100", "comment": "What's your favorite dumb moment on the show? Like plot holes, bad props, all of the \"science\"? I love this show but the CW of it all has me laughing.", "timestamp": 1763759587, "label": "0"}
{"original_topic": "the_100", "comment": "I can’t stand Jasper in seasons 3 &amp; 4. I don’t care if they were trying to make him the “realistic one”.", "timestamp": 1763759587, "label": "1"}
{"original_topic": "the_100", "comment": "Will HBO MAX have the 100 after it leaves netflix in December? ?", "timestamp": 1763759588, "label": "1"}
{"original_topic": "the_100", "comment": "Leaving Netflix I’m sure most people here probably now but the show is leaving Netflix on December 18th", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "What is your dreamed Storylines that inspired by Novel, etc for Season 6-7 For me here is my\n\n• To Serve Man Novel (Storyline similar where only Raven realizes but nobody believes her until end)\n\n• Reanimated Corpses similar to Necromorphs (Unknown disease found in the Ark slowly turn everyone excluding those extremely smart)\n\n• Alien Invasion of Ark (Ark Council indirectly caused everyone receiving A Fate Worst Then Death)\n\n\n\nWhat about you", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "Octavia is insanely cringe wtf I feel like the show is going downhill after season 2 and I've already accepted it but the floor kid leading and being better than grounders who have been fighting for their whole lives fills me with so much cringe that it physically hurts lol. Surely I can't be the only one that feels that way right ?", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "Can someone please make an edit of the 100 to The Only Thing Left by Vincent Lima Just listened to this song for the first time and I feel like it would be PERFECT for the 100. Not sure which couple in particular, maybe Clarke and Lexa or just a mix of couples? Please go listen to it if you haven't heard it before and tell me it's not perfect lol", "timestamp": 1763759588, "label": "1"}
{"original_topic": "the_100", "comment": "Most random characters in The100 \\-Bellamy imaginary  girlfriend\n\n\\-everyone best friend Riley\n\n\\-budget Cooper\n\n\\-that black market woman in S1 on the Ark\n\n\\-primehard characters showing up in the last 2 episodes of S6 (did the guy who was supposed to brainwash Jordan dies in S7 or what?)\n\n\\-Knight the grounder whose sole purpose is to oppose indra\n\n\\- X Y Z the heroes who saved sanctum in S7…\n\nBEST RANDOM CHARACTER (a character showing up out of thin air becoming a good character): Madi\n\nWORST RANDOM CHARACTER (a character showing up out of thin air becoming a terrible character): Shitheda\n\nM.I.A. CHARACTER: Gaia (to the point  she’s played by a stunt double in the season finale)", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "Clair de lune I realized Clair de lune was playing in 2x3 which got me so hyped lol. I kinda figured at that point they had something more sinister at play.", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "Season 1 Ok so obviously they were sent down on year 97 but we all know they couldve gone earlier So my theory on when they couldve gone is that the first kids born in space could have been on the ground because we know the mountain men could only survive with radiation proof bone marrow and that happens by adapting your marrow to the environment your born in so they form the ark on what year 3 out of 100 and they pop some kids out and sent down on year 20 of 100", "timestamp": 1763759588, "label": "0"}
{"original_topic": "the_100", "comment": "Polis and azgeda If the grounder coalition had problems with azgeda agression why didn’t they just build a medieval like wall around polis? There was plenty of debris left over from the bombs so it’s not like they couldn’t.", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "Should I watch past season 5? I stopped watching sometime 2017 and I’m rewatching now, DETERMINED to finish. But… I’ve heard more than one person say that season 5 is the better ending. \n\nFor context I am a Bellarke but I also love Lexa and there are plenty other characters I care about just as much.\n\nI’ll most likely try to finish all 7, but what’s the common consensus on this sub?", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "Bellamy is owed an apology I finally finished watching The 100. Bellamy was right. And Clarke shot him. Then, O &amp; Echo instantly forgave Clarke. \n\nWhen they realise he was right about the whole transcendence thing, where was the regret from Clarke? Where was the anger from O &amp; Echo? Poor Bellamy.", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "Given the budget and non MA/TV-14 rating, this is one of the best shows I've ever seen Game of Thrones was more violent and had nudity. Same story with The Sopranos. Those are 2 of my all time favorite shows. I can't believe this little CW show ended up being so good! I'm on my 3rd re watch now. The acting, writing, creativity, suspense and drama here are all top notch. I was a skeptic and put this show off for years. I thought without the TV-14/MA rating, I wouldn't be interested. Boy was I wrong. I tend to like more \"real world\" shows (Yes, I know I like GOT). I've never seen any Lord of the Rings or any Harry Potter and don't venture in to Sci-Fi often. I thought that was the target audience here. After my first two watch's of The 100, I couldn't stop thinking about it. To me, it's the best non rated R series ever next to Breaking Bad. What a fun ride from start to finish. Bravo 100, you knocked this outta the park!!!", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "Was it ever explained how Mount Weather... Was able to feed all their citizens a full buffet every day? I know they're on the ground so it's not the same situation as the Arks limited resources, but they were still all locked inside every day so I doubt they were able to have a garden growing outside? Unless it was like how the Praimfaya bunker had an underground garden, but much better equipped since it was a military facility? Was this ever answered or what do you all think?", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "First Watch I just finished my first watch-through of The 100, and I loved the earlier seasons, pre-S06.  It seemed that things fell apart for me once they left Earth.  I realize that there may have been delays in production and cast changes, but it seemed like a huge departure from the overall plot.  I realize it is just me... but.  \n\nI really liked the story arc of Octavia and Indra, but hated the arc of Bellamy.  The way they handled Emori's death was sweet, and I understand that Murphy had to pay some sort of a price for his horrible mistakes.  Clarke's arc seems about right... But I do feel that she did everything for the betterment of her friends and her people... and killing the guy in front of the judge kind of seems forced. \n\n  \nThe ending I do not like.  I do like that her core people come back to be with her... but I don't like that they are ostracized and they can't repopulate.  IDK, it seems like that is too harsh a punishment when all the others (presumably all humanity) got to transition regardless of the \"sins\" they have committed.", "timestamp": 1763759589, "label": "0"}
{"original_topic": "the_100", "comment": "Pluribus has season 7 vibes     Without spoiling the details of the excellent new show Pluribus (beyond its trailer), it seems like a highly nuanced exploration of humanity forced into a hive mind, very similar in many ways to The 100’s transcendence, and whether “we” would be better off that way or not.   I think The 100 could have really explored that theme much more deeply if ‘book 2’ was given at the very least another season, which we all know didn’t happen for many reasons, and would have made s7 much less rushed (yes I know that’s only one of its problems lol).    Anywho, check it out if you haven’t.", "timestamp": 1763759589, "label": "1"}
{"original_topic": "the_100", "comment": "So what would happen if a father had two kids? In the 100, we know that if a woman has two kids, she's floated, but what if a man has a kid with two different women? Would that technically get him floated?\n\nI want to write a fic and possibly have Wells have a younger sibling and I'm just trying to figure out how it would work", "timestamp": 1763759590, "label": "0"}
{"original_topic": "the_100", "comment": "I think I need to rewatch this show. I watched it a few years ago with my brother.  For some reason it won’t get out of my head recently.  Mostly I just feel sad because of all the sad parts, and as long as I keep thinking about it, I keep feeling sad.  So I think the only way to stop thinking about it is to rewatch it and finally put the whole thing to rest.", "timestamp": 1763759590, "label": "0"}
{"original_topic": "the_100", "comment": "I like Pike I don't agree with what he did but DAMN, not only does he have mad aura. He's also hot as shit.", "timestamp": 1763759590, "label": "1"}
{"original_topic": "the_100", "comment": "The 100 as a modern video game. Do it! If Starfield, Fallout and Diablo 4 had a baby! Maybe a bit of Assassin’s Creed…\n\nBoom! \n\nThe 100 video game. \n\nI wanna play as Octavia! 🫶🏻", "timestamp": 1763759590, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Daily reminder that neither Mike nor Walt were \"right\" or \"wrong\", they were both pretty terrible people I saw a post yesterday about how Mike was wrong in his argument against Walt about how they had a good thing and Walt blew it up. I actually don't disagree with everything said about Mike's \"points\". I agree with a lot of it. \n\nI think Gus had Tomas murdered or at least knew that's what the dealers would do. Think about it. Gus' big thing is that his people don't operate without his consent or knowledge. Gus liked these dealers so much, he risked his relationship with Walt to protect them. There's no way they did that without Gus having at least mild knowledge of it. I think it was a play to get Jesse killed. Jesse goes to retaliate, believing Walt wouldn't care or react or even know about it until Jesse had already gone to the dealers. They were already waiting for him, Jesse gets gunned down and Gus consoles Walt after having the dealers killed by Mike for killing Tomas and causing the situation to begin with. Now Gus has Walt, his perfect lab and no more \"junkie\". Walt knew this, he figured it out and literally told Gus that hypothetically Jesse might have believed it was Gus' doing. The show writers wouldn't have Walt say this unless they wanted us to think about it. \n\nBut does that make Walt the good guy? Or Mike? No. Mike wanted to kill Jesse for a long time. He wanted to kill Jesse just for doing drugs after his girlfriend died. Literally told Walt, \"Let me take care of it\" intending to kill Jesse at a drug house when he was consumed with grief. The same Mike that we're supposed to believe saw Jesse as a son. \n\nOn the flip side, Mike figured Walt out and knew exactly what kind of man Walt was. Walt isn't a saint. He kept Jesse alive for his own selfish reasons. He used Jesse, manipulated him, took advantage of him. And let's not forget... Walt caused Jane to turn over and choke and then stood there while she choked. Walt is also the reason they got mixed up with Gus to begin with. \n\nHere's the list of garbage moves Walt made that caused Jesse's life to get progressively worse at every turn: \n\n1. When they were making cash hand over fist, Walt freaked out about Skinny Pete getting mugged which is absolutely a thing that dealers have to deal with. This put Jesse in a compromising situation for a wad of cash that they could easily make back on the back end. No retaliation is bad for business? You can retaliate in other ways. Black list those \"customers\" and they'll find a way to pay you back. Like Jesse said, they had the best product and no one else was dealing because Tuco was dead. \n\n2. After Jesse gets caught up in a situation that leads to a man's death, he starts getting cocky and pushes for them to expand. He tries to act like a know it all, pulling out a map and *teaching* Jesse, the one who is in charge of business, new areas to expand to. Jesse literally warns him that going into new territory will lead to violent encounters but Walt is happy to milk the MISBELIEF that Jesse killed Spooge even though he knows Jesse and his crew are no killers. At this point, they don't even have junior dealers working for Badger, Skinny Pete or Combo. \n\n3. Every single thing that Jesse warned Walt about happens. First, Badger gets arrested which costs them $80k to resolve. This also loses them a dealer. And then, disaster: Combo gets killed. Where? In new territory where Gus' dealers are. This means they're down two dealers and only have Skinny Pete. And he naturally wants out because Combo is dead. This also puts Jesse under tremendous stress which leads to him leaning heavily into drugs. Walt starts worrying about how they're going to sell 50 pounds of product, but he doesn't seem AT ALL worried about Jesse. He finagles a deal with a guy who knows a guy who knows a guy and manages to get a deal to sell all of his product to Gus. At this point, there's no doubt that Gus is most likely buying it just to get it off the market. \n\nThe entire reason they end up in business with Gus, the entire reason Combo was killed by Gus' dealers, the entire reason this whole business deal with Gus even starts is due to **WALT'S EGO**. His ego is also what led to them having their run-in with Tuco. Walt was angry about $1500-$2000 a day being too slow for him and wanted to sell to a distributor. Walt was angry about needing pseudo for a traditional cook so he concocted the plan to steal methylamine. Out of everyone, Gus and Walt are the only ones who didn't want to \"get out\" of the business. \n\nMike was a lot of things, and up until he finally warmed up to Jesse, he was a piece of shit in a lot of ways, but he wasn't in the business to be in the business. He was happy to get out ahead at various points in the series. Him and Jesse were willing to walk away, sell their shares of the methylamine and walk away with more money than they could've earned in a lifetime. But who wanted to stay? Walt. \n\nIt's easy to see Walt as the reasonable one who wanted to help Jesse. But it's important to understand that almost every time Walt \"saved\" Jesse, he was saving Jesse from a horrible situation that **he himself** put Jesse in.", "timestamp": 1763759590, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Would Walter or Jesse ever rat each other out to the FBI if caught or remain loyal? Just in case Walter or Jesse ever got arrested or caught red-handed separately or together, would these guys ever rat on each other to the police and FBI to save themselves or would they remain loyal?\n\nAlso why didn't Walt rat out Gus or set him up after he  dominated his life? Would Gus rat on anyone? Would Skinny Pete and Badger rat on Jesse and Walt if they got into trouble?", "timestamp": 1763759590, "label": "1"}
{"original_topic": "breaking_bad", "comment": "How they all live in nice houses, yet don’t have the money for medical care The Whites live in a good house with a pool. I mean, it’s  not a mansion, but it’s a decent place. Yet, they don’t have the money to pay the bills, and cancer bills specifically.\n\nHank and Marie live in a real nice house too, but didn’t have the money for Hank’s physical therapy.", "timestamp": 1763759590, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Finished Breaking Bad after watching it for the first time As you can see I'm many years late but yesterday I just finished the series and it has completely set the bar for any television series I watch after which I'm sure is a universal experience for all the fans. I remember in high school when Tumblr was huge how big the show was and how much hype was behind it. I'm not really a huge tv person nor do I usually give into the hype of things but a few months ago I was looking up \"best television series of all time\" and of course Breaking Bad was consistently mentioned as being #1. I'm so happy I finally got around to watching the series, I'm just sad that I'm so late. The entire cast was phenomenal, every episode from the very first one pulled me into and kept me surprised, entertained and yet astonished at how beautifully it was shot. I can't even explain how incredible this show is. I hope Vince or Bryan or Aaron write a novel about the experience of it all some day. And now I plan on visiting New Mexico!", "timestamp": 1763759591, "label": "1"}
{"original_topic": "breaking_bad", "comment": "I don’t get this line", "timestamp": 1763759591, "label": "1"}
{"original_topic": "breaking_bad", "comment": "Least favourite characters?", "timestamp": 1763759591, "label": "1"}
{"original_topic": "breaking_bad", "comment": "My final rating for each season of breaking bad I found season 5 forced because of things like Lydia moving an entire drug empire alone, deaths that had no investigation whatsoever, prison deaths with no police around to stop them and many other things.", "timestamp": 1763759591, "label": "0"}
{"original_topic": "breaking_bad", "comment": "Unexpected BB reference in Batman/Superman World's Finest #10", "timestamp": 1763759591, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer talks about the atomic bomb - Interview 4k Colorized (1965)", "timestamp": 1763759591, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer Interview (1965) – Was the Atomic Bomb Necessary? | HQ Colorized", "timestamp": 1763759591, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Barbie vs. Oppenheimer - Epic Rap Battles of Twin Releases (Feat. garbageGothic, S.R.P. &amp; Zawesome)", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "💎💎💎💎💎💎Thanos vs jJ Robert Oppenheimer ☢️", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "J. Robert Oppenheimer ~ 𝑪𝒂𝒏 𝒀𝒐𝒖 𝑯𝒆𝒂𝒓 𝑻𝒉𝒆 𝑴𝒖𝒔𝒊𝒄", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "School poster For my school i need to make a poster about a famous physicist. I figured i wanted to make a poster about Robert Oppenheimer. But i dont know anything about him. Anyone can help me out with things i should include??", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer edit❤️", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Christopher Nolan's Magnum Opus", "timestamp": 1763759592, "label": "1"}
{"original_topic": "oppenheimer", "comment": "I have found opennheirmer phone number  (931) 307-0135", "timestamp": 1763759592, "label": "0"}
{"original_topic": "oppenheimer", "comment": "This is such a cool shot.", "timestamp": 1763759593, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer and the Chevalier Incident? How about Lewis Strauss and the Chicanery Incident https://www.reddit.com/r/betterCallSaul/s/TzUJhYxDPd", "timestamp": 1763759593, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer (2023) [ambience]", "timestamp": 1763759593, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Why Oppenheimer is a disgraceful movie", "timestamp": 1763759593, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer - Destroyer of Worlds", "timestamp": 1763759593, "label": "1"}
{"original_topic": "oppenheimer", "comment": "OPJE - DP and Mobile Wallpaper #OscarWinningMasterpiece", "timestamp": 1763759593, "label": "0"}
{"original_topic": "oppenheimer", "comment": "What Really Happened to Oppenheimer?", "timestamp": 1763759593, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer Convert Event With Christopher Nolan and Cillian Murphy", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "My Top 15 Favourite Films of 2023", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer is in the r/FavoriteCharacter Bracket", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "OPPENHEIMER: A Nuclear Experience (Video Essay) Here's to the Best Movie of 2023! Happy New Year everyone!", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Top 10 Best Movies Of 2023", "timestamp": 1763759594, "label": "0"}
{"original_topic": "oppenheimer", "comment": "Oppenheimer | Original Trailer", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Honest Trailers | Oppenheimer", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "The Beauty of OPPENHEIMER", "timestamp": 1763759594, "label": "1"}
{"original_topic": "oppenheimer", "comment": "Do you all think Oppenheimer was sapphic?", "timestamp": 1763759595, "label": "1"}
{"original_topic": "wednesday", "comment": "Enid Cosplay... Tiktok https://preview.redd.it/abxuq8lxun2g1.png?width=168&amp;format=png&amp;auto=webp&amp;s=67d621b72a71601a22a8d9d620b89f5ee1d636fb\n\n[https://www.tiktok.com/@.kitsumimi/video/7565253117231631629](https://www.tiktok.com/@.kitsumimi/video/7565253117231631629)\n\n[https://www.tiktok.com/@.kitsumimi/video/7567479074080263437?is\\_from\\_webapp=1&amp;sender\\_device=pc&amp;web\\_id=7495502339836331525](https://www.tiktok.com/@.kitsumimi/video/7567479074080263437?is_from_webapp=1&amp;sender_device=pc&amp;web_id=7495502339836331525)\n\n[https://www.tiktok.com/@.kitsumimi/video/7566308602735004942?is\\_from\\_webapp=1&amp;sender\\_device=pc&amp;web\\_id=7495502339836331525](https://www.tiktok.com/@.kitsumimi/video/7566308602735004942?is_from_webapp=1&amp;sender_device=pc&amp;web_id=7495502339836331525)", "timestamp": 1763759595, "label": "0"}
{"original_topic": "wednesday", "comment": "Visiting Netflix House Philadelphia &amp; \"Wednesday - Eve of the Outcasts\"", "timestamp": 1763759595, "label": "1"}
{"original_topic": "wednesday", "comment": "Artist: Juanmaoao **Yoko**: Enid! Why are you wearing \"Wednesday\" make up lately too?  \n  \n**Enid**: Why? Wow! Sometimes i want to try a new style!  \n  \n\\------  \n  \n**Enid**: I really want to try this year's new spring shades...  \n  \n**Wednesday**: If you like It, buy It; stop making those puppy-like whimpers.  \n  \n**Enid**: I don't want It!  \n  \n*\\*KISS\\**  \n  \n**Enid**: Kissing freedom is more important, you idiot Wednesday!  \n  \n**Wednesday**: ... You know you can kiss me after i tale my allergy medication, right?  \n  \n**Enid**: AH CUTE!", "timestamp": 1763759595, "label": "0"}
{"original_topic": "wednesday", "comment": "Big Smoke's Order ❌️ Enid's Order ✅️ (I tried combining steak sauce with chocolate syrup... let's just say, I still haven't got my appetite back yet)", "timestamp": 1763759595, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday by Hot Toys Loving this figure so much ! Made a themed inspired diorama for her ! Insta : [sidetoys](https://www.instagram.com/sidetoys?igsh=MXFpZHE4M2cxZGpn)", "timestamp": 1763759595, "label": "0"}
{"original_topic": "wednesday", "comment": "Art by: isatpanart", "timestamp": 1763759595, "label": "1"}
{"original_topic": "wednesday", "comment": "Wednesday dance in game btw the game is once human", "timestamp": 1763759596, "label": "1"}
{"original_topic": "wednesday", "comment": "A subtle gag in The Addams Family is that they make things up In the 1991 'The Addams Family' movie, the Addamses deliberately embellish, misstate, or exaggerate things to add gravitas, making themselves seem more heretical and in touch with darkness. The Netflix show continues this, but Wednesday takes a more philosophical approach rather than a dramatic or blasphemous one. (see Gallery)\n\n\\---\n\n[Agatha Christie Community Forum](https://community-archive.agathachristie.com/discussion/707/three-coincidences-are-a-proof-its-real-ac-quote)", "timestamp": 1763759596, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday Addams Short Just a joke video about Wednesday Addams reacting to her roommate Enid becoming the worlds loudest snorer.", "timestamp": 1763759596, "label": "0"}
{"original_topic": "wednesday", "comment": "Some Weds &amp; Enid draws [https://www.zerochan.net/3888993](https://www.zerochan.net/3888993)\n\nhttps://preview.redd.it/612i11jpej2g1.png?width=920&amp;format=png&amp;auto=webp&amp;s=34a85edbac7b22e1e530b6b13fd60c67ecda3520\n\n[https://x.com/yellow\\_nicky/status/1624800455590088709](https://x.com/yellow_nicky/status/1624800455590088709)\n\nhttps://preview.redd.it/rertmx7vej2g1.png?width=680&amp;format=png&amp;auto=webp&amp;s=ffc46ba64396a1aad8ee0d14d5ba405c044ae9cd\n\n[https://www.facebook.com/oceaninspace/posts/now-that-wednesday-season-2-is-out-it-made-me-realize-i-never-actually-posted-th/1366265981532126/](https://www.facebook.com/oceaninspace/posts/now-that-wednesday-season-2-is-out-it-made-me-realize-i-never-actually-posted-th/1366265981532126/)\n\nhttps://preview.redd.it/wf7pcqv3fj2g1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=f7b2f39efb80305cd034cce5b4551e3a47102e1b\n\nhttps://preview.redd.it/mobire97fj2g1.png?width=1212&amp;format=png&amp;auto=webp&amp;s=4de15ce88b0dd139084e0bbc20a4d42bbfeb454e", "timestamp": 1763759596, "label": "0"}
{"original_topic": "wednesday", "comment": "Enid's cosplay Tik Tok \n\nhttps://reddit.com/link/1p2p1qr/video/k2l9biqadj2g1/player", "timestamp": 1763759596, "label": "0"}
{"original_topic": "wednesday", "comment": "Weyler Art Artist: Doodlez", "timestamp": 1763759596, "label": "1"}
{"original_topic": "wednesday", "comment": "I really wish Tyler and the other Hydes were written more like actual Jekyll-and-Hyde monsters Basically, exactly what the title says. A lot of the writing in this show is… let’s call it “wonky,” and the show's lore suffers from it. The Alpha werewolf lore feels like it was made up in 5 minutes, and the Hyde lore isn’t much better. The show dedicated two seasons to Hydes, and it still feels all over the place.\n\nHydes are clearly inspired by Robert Louis Stevenson's novella *The Strange Case of Dr. Jekyll and Mr. Hyde*. In the novella, Dr. Henry Jekyll develops a potion to separate his good and evil sides. When he drinks it, he transforms into evil Edward Hyde. Over time, Jekyll's transformations become more frequent and involuntary. The novella ends with Jekyll's final, unchangeable transformation into Hyde, who then commits suicide. Throughout the story, Jekyll remembers everything he does as Hyde. Hyde is not a separate personality that takes over Jekyll's consciousness; rather, Hyde is Jekyll acting without his usual inhibitions, and Jekyll is fully aware of Hyde's actions. Essentially, Jekyll tries to use the transformation to indulge in his darker impulses.\n\nThat’s a very cool concept. And in Season 1, it seemed like the show was going in that direction. Tyler’s first transformations are triggered by Laurel’s chemicals. Maybe not at first, but over time, he becomes fully aware of his actions as a Hyde and starts enjoying them, because they give him the freedom to act on impulses he normally suppresses. That tracks with the original novella. But then the show adds lore that honestly makes everything messier: the **“master”**.\n\nAt first, I get it; writers needed a way to justify Laurel controlling Tyler and tie the twist together. Fine. But Season 2 introduces Tyler’s mother, and suddenly the whole “master” concept becomes a narrative roadblock. So now apparently female Hydes don’t need a master, only male Hydes do. BUT the master’s control seems optional because Tyler kills Laurel and fights his own mother, AND male Hydes supposedly go “insane” without a master, AND they still die young because each transformation shortens their lifespan. It really sucks being a male hyena. I mean Hyde.\n\nSo… what does a “master” even mean anymore?\n\nIt just feels *messy.* I wish they had stuck closer to the original Jekyll-and-Hyde idea rather than constantly adding plot-convenient rules that contradict earlier ones. And it’s not just Hydes. The Alpha werewolf lore is equally vague and inconsistent.\n\nSeason 3 is going to expand the Hyde/werewolf lore even more with Capri and her mix of Hydes and werewolves, and honestly? I’m scared that by the end of it, things are going to be even more convoluted than they already are, when they really don’t need to be.\n\nAlso, as I was finishing typing all of this, I remembered that in Season 1, Xavier had some weird psychic connection to Tyler/Hyde, which the show never explained. But I guess we’re never going to learn how or why that worked. Oh well…\n\nJust some of my thoughts. What do you guys think about Hydes and how the show handles their lore?", "timestamp": 1763759596, "label": "1"}
{"original_topic": "wednesday", "comment": "Rehabilitating Enid This just came to me.\n\nThe scene is, Wednesday and Fester have found Enid in wolf form, in the woods of Ontario, Canada. Fester leaves them the motorcycle and goes off into the woods for some reason, maybe to find bugs and other food. Wednesday and Enid fall asleep together, and when they wake, Enid is human again.\n\nEnid is in shock from the experience. She can barely speak. Wednesday drives her to a coffee shop (after dressing her in the spare outfit she had in her backpack.) When they get there, they talk, while in the background, this music is playing on the radio. \n\nGo to exactly the 1 hour mark to her the music I am talking about.\n\nhttps://www.youtube.com/watch?v=B3JmtMCJ0ok", "timestamp": 1763759597, "label": "0"}
{"original_topic": "wednesday", "comment": "\"Be Thankful You Can Be Seen...God Bless You\" Agnes's cartoon references and the pyre clue as early foreshadowing.", "timestamp": 1763759597, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday &amp; Enid - The Fire", "timestamp": 1763759597, "label": "0"}
{"original_topic": "wednesday", "comment": "Enid and Wednesday good luck babe edit. Credit: Grace Marchello on youtube Why are there not more wenclair Chappell Roan edits? Her songs are perfect for them.\n\nAnd the way this one uses the bridge in the song, amazing", "timestamp": 1763759597, "label": "0"}
{"original_topic": "wednesday", "comment": "Family Values🕸", "timestamp": 1763759597, "label": "1"}
{"original_topic": "wednesday", "comment": "Art by: PurpleKetchup16", "timestamp": 1763759597, "label": "1"}
{"original_topic": "wednesday", "comment": "Tyler getting dragged into actual Hell and Wednesday saving the day (again) All the Devil, Satan, and Lucifer references are pointing to one infernal destination--as if Wednesday's death drive could resist intervening.  \n  \n*-crappy edit is mine of course*", "timestamp": 1763759597, "label": "0"}
{"original_topic": "wednesday", "comment": "[Credits to @beries_popculture on YouTube] https://youtu.be/-CGMcEk4GXY?si=wI7CxJN_PXjayy3D", "timestamp": 1763759598, "label": "0"}
{"original_topic": "wednesday", "comment": "Remembering that Wednesday is still an anti-heroine Having a strong moral doesn't make her \"less Wednesday\" as many have a somewhat incorrect stereotype of this version of the character.\n\nLet's remember that she didn't kill Thornhill or the killer at the beginning of season two.\n\nUnlike a hero, the anti-hero certainly tends to carry out \"dirtier\" actions but the goal of helping those around him/her always remains and Wednesday, for better or worse, is also this.", "timestamp": 1763759598, "label": "0"}
{"original_topic": "wednesday", "comment": "Wednesday series", "timestamp": 1763759598, "label": "1"}
{"original_topic": "wednesday", "comment": "Why Wenclair Doesn’t Click for Me Anymore- as a huge fan of the ship after s1 I’ve been trying really hard to figure out why Wenclair doesn’t hit for me anymore, especially because I *want* to love them the way I did back in season one. I genuinely enjoyed their dynamic at first. Their contrast felt natural, their growth felt earned, and the whole “Opessites attract” trope actually worked really well. They had softness, tension, vulnerability, and all these tiny moments that made their connection feel warm and meaningful. I really believed in the version of them that season one was building.\n\nBut after S1, something changed for me, and it’s been harder than I expected to reconnect with the ship. In season two, the relationship that hooked me just… wasn’t there in the same way. They spent a lot of their scenes either arguing, miscommunicating, or being emotionally out of sync, and I never felt like the show gave them the time to rebuild or deepen the connection they started with. Even when they *did* have an emotional moment, like right before switching their bodies back, it didn’t carry that same spark or weight from S1. It felt more like a leftover of what they used to be rather than a continuation of what they could’ve become.\n\nI’m not saying the writing was malicious or that the characters stopped caring about each other, but the shift in their dynamic made it harder for me to see the romantic potential that used to stand out so clearly. Instead of growing closer, it felt like they drifted apart, and the emotional thread between them got thinner instead of stronger. And when a ship relies heavily on chemistry, softness, and contrast, that shift really affects how you connect with it.\n\nI also want to be clear: this isn’t an attack on Wenclair or the people who love it. I completely understand why the ship is meaningful to so many fans, and I think the version of Wenclair in season one was genuinely compelling. I’m not trying to take that away from anyone. I’m just being honest about my own experience: after S1, the show didn’t give me the same feeling or energy that originally made me see their relationship in a romantic light.\n\nThe frustrating part is that I *wish* I still shipped it. I wish I could recapture that spark I felt the first time around. I wish I could go back to seeing what everyone else still sees. But the shift in how they were written in S2 changed the way I interpreted their dynamic, and no matter how much I try to get that old feeling back, I can’t force it.\n\nSo this isn’t a hate post, or a dismissal, or some superiority compex thing. It’s just me admitting that the version of Wenclair I connected to isn’t really present anymore, at least not for me. And I really wish that wasn’t the case.", "timestamp": 1763759598, "label": "1"}
{"original_topic": "wednesday", "comment": "Based on your current phone battery and birth month, what are your weekend plans?", "timestamp": 1763759598, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "My best Friend walks around like this 24/7. It's giving me costum vibes tho. What do you think?", "timestamp": 1763759598, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I’m the oldest - CLEARLY.", "timestamp": 1763759598, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I miss the grounded and realistic tone that the early seasons had I’ve rewatched the entire show many times at this point and the more often I do, the more often I find myself gravitating towards the earlier seasons. I think there’s something about them where the characters just feel more “real” and the dramatic stakes feel more relatable overall.\n\n\nWhen you analyze it, the first two seasons are about an illegitimate businessman trying to raise both himself and his dysfunctional family through the criminal underworld of the early 20th century. Their goal is to simply survive in this society.\n\n\nIn Season Three, the focus becomes more worldly and grand in scale. Tommy begins doing secret diplomatic missions for the British intelligence service and international diplomatic relations are at play. The Season Three finale ends with a large action set piece involving a train chase and explosives. Contrast that with the previous two finales where main characters simply get shot.\n\n\nAlso before people inevitably start accusing me of “hating on” the later seasons. No, I don’t hate them. I enjoy the later seasons, especially Season Three and Five. I think they both do a great job of telling a political narrative while keeping the tone grounded and suspenseful. The finale of Season Five is so simple and yet grips with tension.\n\n\nWith the movie coming out soon and the story of it once again involving Tommy doing secret agent James Bond esque missions for Churchill in the middle of a World War. I can’t help but hope that they don’t forget about the smaller character moments. Peaky Blinders is at its best when it focuses on the individual, real world emotional drama of its characters. And it can be easy to lose that when the stakes are so grand.", "timestamp": 1763759598, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Ada is underrated I’m watching the series for the second time. And I’ve finally gotten to season 6 and I have to say Ada is written so well. I didn’t give enough appreciation to her character the first time around. Her character development is really quite fascinating to watch. Starting out as a communist to widow to political advisor and major entity in the Shelby company. She is strong willed, intelligent, and not afraid of Tommy which I love. She is also super kind and loving to her family and the men she deals with. Despite not always being directly involved in every episode the actress always nails her performances. Her character is essential but sometimes unassuming. \n\nThis thought really came about because I’m watching the interactions between her and Lady Diana and it’s incredible to watch. She is witty and sarcastic enough to keep up with the “digs” from Diana. But still remains loyal to her roots. I love that she dresses so well and is threatening without ever doing too much.  I just have to give my props to this character and the actress. So well done.", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "The moment he looks up and looks at the camera, the lyrics of the song say:\"you know\u2028 you’re never coming back\" 💔 And this is so sad : Knight also referenced his relationship in the Esquire interview, telling fans why Grace had to be killed off. \n\nHe said: “It was tempting to give him that sort of happiness with Grace. But I just think if he ever finds happiness and contentment then the thing that makes him extraordinary will probably go away.\"", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "I love this picture!!", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Paul Anderson seemingly confirms he will be in new peaky blinders movie", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "His shadow os cast wherever he stands", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "What is the sexiest scene in Peaky Blinders for you, personally? I'm intrigued ;)", "timestamp": 1763759599, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Arthur Shelby makes an appearance in the new stadium announcement video for Birmingham City", "timestamp": 1763759600, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Hope this hasn't been done before", "timestamp": 1763759600, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "That's it. That's the post.", "timestamp": 1763759600, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "..He used to be the guy from 28 days later, not anymore.", "timestamp": 1763759600, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "Season 3 ending ( Deal with Tatiana ) So we saw at the when she said \" you would never steal from your family would you mr shelby ? \" \n\nIt just occurred to me, did they make the deal on tommy's wedding night itself? because at the end of that ep , tommy told polly he's going to steal. \" i'm a gambling man \" when polly asked if he would risk it all. so she was the one who suggested it. and all this while....he made a promise to grace...a vow ...to stop al this business. what do you guys think", "timestamp": 1763759600, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Peaky Blinders x Snowfall I am watching Snowfall right now and I'm still on Season One, after I've finished Peaky Blinders, and it has my mind thinking. Snowfall starts in 1983 and we know there'll be more Peaky Blinders stuff after the movie, in 1953; so hypothetically if a Shelby descendant of Thomas and the gang moved to Los Angeles, and started their run against Franklin Saint - how do you envision that? Considering this Shelby is like Thomas and the family, how would they play Los Angeles out? Because I have so many different scenarios going through my head right now.", "timestamp": 1763759600, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "The most underrated villain who probably got the closest to killing Tommy In season 2 final scenes of ep 1, Sabini almost kills Tommy because he probably had underestimated the guy, Sabini was surprisingly smart, and got to Tommy before he even had a change to meet with Alfie and nearly killed him, Tommy was only saved because of the unknown fact that at the time he was being watched by Major Campbell and his men, the only thing that saved Tommy's life.", "timestamp": 1763759600, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "Every Obe Crossover 👿", "timestamp": 1763759600, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Bennu is hooked on season 5 She’s enjoying the new Arthur storyline", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Everything that came out of Billy Kimber's mouth made me laugh", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Jack Nelson's Agenda Why was Jack planning to kill Thomas? Tommy was Jack's bridge to all the powerful people in Britain, he offered to spy on Churchill, Jack allowed him to export Opium to America, he clearly liked Tommy's character and expressed multiple times how they are similar people. Why then was he planning to kill Tommy Shelby? Is the answer clarified in the series or will we see the reason in the upcoming movie?", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Tommy Shelby's character Do you think any other actor could pull off Tommy Shelby in Peaky Blinders, other than Cillian Murphy? What would be your Top 2 picks?", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "..Best man!", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Can someone explain the 5 tons of opium? We know Chang had the opium.\nWe know Thomas agreed to move the opium.\nWe know Arthur fought off an attack for the opium.\n\nWhat happened to the Chinese and how did Thomas end up in total control of 5 tons of opium?", "timestamp": 1763759601, "label": "1"}
{"original_topic": "peaky_blinders", "comment": "Tommys \"confession\" season 3 I was just thinking about the scene where Father Hughes forces Tommy to tell the Russians he was wrong/lying about Hughes. This comes after  tommy was severely beaten and left without medical attention. It looked blatantly coerced, is there any way for Hughes to look more guilty than to bring Tommy in on deaths door to confess. Even with zero context it looks like Tommy is not admitting he was wrong but was forced into saying something.", "timestamp": 1763759601, "label": "0"}
{"original_topic": "peaky_blinders", "comment": "I love this scene 😂", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "Hunter Schafer reminds me of a Young Claire Danes Hunter Schafer reminds me of a young Claire Danes — that same translucent fragility paired with an undercurrent of steel. I think San Levingston must have thought the same thing when he dressed her as Juliet from Baz Luhrmann’s 1996 remake. The resemblance wasn’t just visual; it was tonal. That soft, celestial innocence framed in something bold and cinematic. Angel wings, whiteness, a kind of luminous melancholy that feels unmistakably Juliet.\nAnyone else catch that? Or was it just me having a déjà vu flash of Claire Danes drifting through that party scene like a heartbreak waiting to happen?", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "S01E03: I thought both Cal—at the carnival—and Nate—at the lake—were going to kill Jules if she had refused to comply, is it possible that Cal would have killed her?", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "Bitch you are my soulmatee", "timestamp": 1763759602, "label": "0"}
{"original_topic": "euphoria", "comment": "How to have a Euphoria style month? December is approaching. And it is a month that reminds me a lot of the series because the first time I saw it was around this same time of year, in addition to the fact that the first season is temporarily located in the last months of the year.\n\nSo, I'm looking for a way to make December a “euphoria” month. I don't know, let my life feel like that for a moment. As if I were a character within the series. But without the drugs hahaha. I think it would be fun to get out of my comfort zone.\n\nYo sé que adoptar un “euphoria lifestyle” es algo que algunos han intentado también.", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "Nate was right and it’s not even 10 years yet Nate: That's probably why you're spending all your time with someone who's going to leave you and won't even remember who the fuck you are in 10 years.", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "Sydney was on this sub! 🤣", "timestamp": 1763759602, "label": "1"}
{"original_topic": "euphoria", "comment": "do you guys think this new religion aspect will ruin the appeal of the show? i made a post about this a couple days ago and it seems like most of the people in this sub are not religious or said they would drop the entire season if it was about religion.", "timestamp": 1763759603, "label": "0"}
{"original_topic": "euphoria", "comment": "S2 e5 I’m kind of really annoyed like Jules went and told rues mom about the drugs \nA:without thinking of any of the consequences (like drug dealing can put you in so so much harm) and she didn’t think about any of that \nB: so she’s aloud to go and sh without her dad finding out but I’m sure she’d be just as pissed if rue went and told on her.", "timestamp": 1763759603, "label": "0"}
{"original_topic": "euphoria", "comment": "I ❤️ her", "timestamp": 1763759603, "label": "1"}
{"original_topic": "euphoria", "comment": "I love it when she does that", "timestamp": 1763759603, "label": "1"}
{"original_topic": "euphoria", "comment": "Manny Santos walked so that Maddy Perez could serve and leave no crumbs They are the same, here me out!\n\nManny is Maddy TV MUTHA!\n\nManny was abused by a boy her age (Peter), had a backstabbing blonde best friend (Emma) who also hooked up with the guy that hurt her. Both loved and cherished their friends and tried to help them get off drugs. They were also cheerleader. Both were fashion divas who could whoop a bitches ass and\n\nManny from Degrassi walked, so that Maddy could eat and leave no crumbs.", "timestamp": 1763759603, "label": "1"}
{"original_topic": "euphoria", "comment": "I want to see memes from East Highland students after Lexi's show Let's imagine that East Highland has an Instagram account for memes, or class or inter-specialty groups, on WhatsApp or elsewhere. \nGiven the number of people who were present at Lexi's show, which we can say revealed all the secrets of Maddy, Kat, Rue, etc group, It's possible that people were still talking about this show in the weeks that followed\nGive me examples of the same typical comments that East Highland students would make about the show, like POV Kat, POV Cassie, etc...", "timestamp": 1763759603, "label": "0"}
{"original_topic": "euphoria", "comment": "Maddy Perez or Adrian Lee", "timestamp": 1763759603, "label": "0"}
{"original_topic": "euphoria", "comment": "fez/angus cloud in season 3 how does everyone think they’re going to address angus cloud’s passing? we lost ash tray at the end of S2, but is there a chance we could get “flashbacks” of fez? some unused footage? obviously they can’t just pretend he was never in the show, there’s the time jump.. but will they try and play it off like he’s in prison, something happened after ashtray was s*ot? i’m just so interested, especially with lexi too, as they were basically about to get together?\n\n\nif anyone has any sources that have mentioned what/if they plan to address that’d be helpful, just such a bittersweet feeling knowing a huge corner stone of the show won’t be there, RIP angus cloud.", "timestamp": 1763759604, "label": "1"}
{"original_topic": "euphoria", "comment": "S2e2/3 recap straight up didn't happen? Hi all, I'm watching for the first time so apologies if this is explained later but I didn't want to risk spoiling myself. I just finished s2e2 and moved onto e3, but the recap was instead showing the resolution of all the plotlines that were only just established? Is HBO missing something or am I?", "timestamp": 1763759604, "label": "0"}
{"original_topic": "euphoria", "comment": "BB Unpopular opinion but I kind of wish they went more into BB’s story like I’m she’s a side character I’m just interested in what she had going on in her life..", "timestamp": 1763759604, "label": "1"}
{"original_topic": "euphoria", "comment": "If You Know, You Know: Why Labrinth's Score Lives Rent-Free in Our Heads. \nhttps://reddit.com/link/1p117dy/video/a2i9qt2yw52g1/player\n\nThat *Euphoria* score is an absolute banger. I swear it just hits different every time. I wasn't ready for that pure cinematic nostalgia—it's a whole mood. I'd pay good money for a memory wipe just to get that first-listen vibe check again. Take my upvote, Labrinth! 🤯🎧✨", "timestamp": 1763759604, "label": "1"}
{"original_topic": "euphoria", "comment": "Just finished watching the series for the first time All I can say is wow. Season 1 was one of the best seasons of a show I’ve ever seen. Everything just felt perfect from the storylines to the acting to the music placements. Just perfect omg", "timestamp": 1763759604, "label": "0"}
{"original_topic": "euphoria", "comment": "Rate my quick pen sketch of Hunter Schaefer", "timestamp": 1763759604, "label": "1"}
{"original_topic": "euphoria", "comment": "Nate &amp; Jules/Cassie/Maddy ok, so I'm reading some of the comments where people think Nate will end up with Jules and that will be part of a his redemption arc. so you guys really think that he will end with someone his dad f\\*ced? that is not redemption, that's f\\*cked up. imo their storyline ended in s2 in Nate's truck.\n\ni'm also reading that Nate and Cassie get married in s3. also not redemption. why would he do that, after turning her down in s2?\n\nimo he belongs with maddy, but I also kinda get that she's probably moved on after 5 years. in s1 finale kat says that \"nate and maddy will probably divorce 3 times, and somehow live a happy life\" and I can't unsee that.", "timestamp": 1763759604, "label": "0"}
{"original_topic": "euphoria", "comment": "Euphoria really destroyed its potential Hey y’all, so I was bored and decided to rewatch Euphoria, and dang guys season 1 is literally so peak. I really feel like Euphoria stands out from all these other high school dramas because the aesthetic and cinematography is just beautiful, not to mention that I also feel like the characters are super realistic (not so much the whole high school aspect because every one of these bitches would be dress coded in two seconds if it was the real world lol) but just the way the characters think and feel, I mean I’m in college now but when season 1 first came out, I was a sophomore in high school and the characters were just so relatable to me.\n\nBut I’m not gonna lie, Euphoria really just wasted away all of its potential with season 2 and how they’re treating the release of season 3. First of all, season 2 was lowkey trash. There wasn’t much in the way of character development or just overall storyline, and after rewatching season 2, it really just feels kind of dragged on. When the hype was going on for season 2, people treated this show like it could do no wrong and so did I, but now I really just feel like season 2 is pretty bad. Lexi’s play was also so unnecessary, like I get that they were trying to show how she was coming out of her shell and stuff, but I feel like they could have done that in a much better way, we as the audience really didn’t need a whole recap of the events of season 1 in a school play that would have never been allowed to exist in a real school. Outside of just the writing though, I mean these people have waited SO LONG to release the next season, it’s gonna be 4 years by the time the new season comes out. I know there were unexpected deaths from the cast which is just a tragedy, but it’s been so long and there’s so many people missing in the show now that I feel like people aren’t even excited about this show anymore, and they should lowkey just call it good, but of course they’re gonna milk it financially for all that it’s worth. It just kind of sucks because season 1 had the potential to make the show the best modern teen drama ever made, yet it failed so miserably.", "timestamp": 1763759605, "label": "0"}
{"original_topic": "euphoria", "comment": "Spoiler I genuinely hate Jules. If you watch the whole thing and don’t agree how not?? All she did was seek any type of validation from ANYONE. She was a whore in my opinion. Especially what she did with Elliot but acted like RUE had feelings for HIM. Everything to do with her has to benefit her.", "timestamp": 1763759605, "label": "1"}
{"original_topic": "euphoria", "comment": "Nates Dad repressed homossexuality led Nate to turn into Frankenstein Hey,\n\nCarl Jacob (Nates Dad) said that is unsolved internal issues, such as repressed homosexuality let him poison everything around.\n\nDo you guys think that the repressed homosexuality of Nates Dad, led Nate into turning into Frankenstein? It was so much that he just transformed.\n\nI can´t wait for the S03 with Nate being Frankenstein.", "timestamp": 1763759605, "label": "1"}
{"original_topic": "euphoria", "comment": "S1 vs S2 screentime differences Rue - S1: 3 hours and 27 minutes vs. S2: 3 hours and 18 minutes   \nJules - S1: 1 hour and 52 minutes vs. S2: 1 hour and 24 minutes  \nNate - S1: 1 hour and 18 minutes vs. S2: 1 hour and 35 minutes  \nCassie - S1: 1 hour and 12 minutes vs. S2: 1 hour and 35 minutes  \nKat - S1: 1 hour and 10 minutes vs. S2: 1 hour and 4 minutes  \nMaddy - S1: 1 hour vs. S2: 1 hour and 26 minutes  \nLexi - S1: 41 minutes vs. S2: 1 hour and 42 minutes  \nCal - S1: 36 minutes vs. S2: 31 minutes  \nFez - S1: 27 minutes vs. S2: 1 hour and 9 minutes", "timestamp": 1763759605, "label": "0"}
{"original_topic": "euphoria", "comment": "Why is Jules’ storyline being kept so under wraps for Season 3? Is there a reason Jules’ Season 3 storyline seems to be the most tightly protected one in the press/leaks? We’ve gotten leaks and hints about everyone else, but her story is totally hidden.", "timestamp": 1763759605, "label": "1"}
{"original_topic": "supernatural", "comment": "That jarring restart feels I first watched Supernatural last year, knew about it when it came out through a friend but didn’t get into it. \n\nI lost interest by S14E16 end as it was just talking and talking about feelings and some crazy power increases that I just stopped watching organically. Restarted 3-4 months ago before I knew it would be taken off and I finally finished it now. Stuff like fighting god, it was a hilarious premise and also god being the only reason they even did anything felt very bad. I was with Dean - yeah, we need to take down this guy, don’t care if he is god 😂 Felt so sad when it got over, not due to their ending, just that the show ended. No more baby, no more Dean and Sam and Cass.\n\nSo next day I restarted again 😂 And oh boy does it feel so jarring but in a great way to restart from the beginning. From the colors to the story, different types of roles they took on ie wildlife guys, homeland security. By season 14, I didn’t bother about either dying but wow in season 1 you really feel the pinch and worry what might happen (even if you have finished the show)\n\nWho else is restarting?", "timestamp": 1763759605, "label": "0"}
{"original_topic": "supernatural", "comment": "Imagine these two working a case together, I’d Love to see it.", "timestamp": 1763759605, "label": "1"}
{"original_topic": "supernatural", "comment": "What do you guys think of Balthazar? https://preview.redd.it/z6a1ifcs6o2g1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=fd4d7ebef0c44fc12923a3a93350a553a572667d\n\nDo you like his character? Do you not like him? What're your opinions on him?", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "Who can demons possess? Hello. I've been rewatching and questioned myself if a demon can possess a shapeshifter for example. He's humanoid i guess or can they really just possess humans? And if yes, where does it stop? A fortune-teller? A magician? Where's the line to unpossessability? Thanks for your answers, sorry if this doesn't fit here. \nTag season 1 because they appear from the beginning.", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "Where can I buy Spanish dubbed full series? I own all but the last two seasons on dvd and have a family member who loves the show and watched it on Netflix. But my dvds do not have Spanish. And if the show leaves Netflix, this person will no longer be able to fully enjoy the show. Where can I buy Spanish audio versions? Even if I have to purchase a region specific dvd/Blu-ray player I will. Just gotta know where I can get them.", "timestamp": 1763759606, "label": "1"}
{"original_topic": "supernatural", "comment": "Can we appreciate Cain? Can we take a moment to appreciate the hilarity of the fight scene in S9E11 where, after letting the demons Dean is fighting in, Cain is calmly flitting around his kitchen making dinner? Dean's half winning half getting his butt handed to him and Cain is just sitting there shucking corn while a demon helps themselves to a knife out of his knife block.", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "Made a poster First time ever doing it so excuse how amature and plain it looks lol. Just be gentle with criticism. I made it for a class assignment.", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "jody and donna ep 8 s 10 currently rewatching and am i the only one that ships donna and jody??? all i’ve seen is “wayward sisters” stuff but are you kidding they had helllllllaaa chemistry. maybe it’s just cause im a lesbian but there’s no way im the only one!!", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "What is your \"wasted\" potential character/storyline? So basically I wanna know what character or storyline you would've like to see more of? Personally for me Jesse Turner like where is he what happened. Also pagan gods and seven deadly sins were waisted potential since they died/were defeated so easily I guess... Anyway what's yours?", "timestamp": 1763759606, "label": "0"}
{"original_topic": "supernatural", "comment": "Dean’s tired, Sam’s angry. Love this episode, S2E3 always gets me. The fact that Dean is tired before Season 2 even ends cracks me up, since I know he’s still got 13 more seasons to go. And Sam’s face reminds me of a toddler who just had their favorite toy taken from them lol.", "timestamp": 1763759607, "label": "1"}
{"original_topic": "supernatural", "comment": "Found a little SPN reference Currently rereading Steve McHugh's \"Hellequin chronicles\", and must have missed this the 1st though", "timestamp": 1763759607, "label": "1"}
{"original_topic": "supernatural", "comment": "Christmas Card from hubby", "timestamp": 1763759607, "label": "0"}
{"original_topic": "supernatural", "comment": "Old seasons Vs New seasons Supernatural is getting taken off of netflix December 17th and I’m currently on season 7 (rewatch) and I can’t decide whether I want to skip to the good new seasons or restart the good old seasons. HELP!!!", "timestamp": 1763759607, "label": "1"}
{"original_topic": "supernatural", "comment": "Season 1 episode 6 skins Trying to watch supernatural again before it’s gone from Netflix. I am in season 2 where Dean is arrested and they mentioned the episode skins which is now missing from Netflix. Anyone know what is going on?", "timestamp": 1763759607, "label": "0"}
{"original_topic": "supernatural", "comment": "Who’s more witty or funnier?", "timestamp": 1763759607, "label": "1"}
{"original_topic": "supernatural", "comment": "Question from an outsider I've seen a couple episodes from the first season, I liked some stories but I found it to be a little repetitive and started doubting wether it has a background storyline throughout the full series. \n\nBasically is it worth watching the show even for ppl who like shows with a complex plot ?", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "Season 13 Finale I just finished the season 13 finale and I just have to rant. I know that Dean would do anything to save Sam. He has proven this time and time again. He let alt-Michael into himself, I think, because he was desperate to save Sam and Jack. But he had to know that the angel was not going to honor the deal and would take him over. Besides Castiel, they haven't had a whole lot of great experiences with angels. He seemed so surprised when Michael did what he did and I was just like, really? What did he expect? That Michael would just quietly leave at the end of that terrible fight (that fight being a discussion for another time). Lucifer is dead (maybe, who knows, the next seasons are all new for me), Dean is gone (I know he gets out of it because I hope they wouldn't beat this dead horse of a plotline for two more seasons), Jack is graceless and Sam is alone again. This series has had some high and lows but I feel like this finale was maybe the worst so far.", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "Why did the switch between Nicki Aycox's Meg and Rachel Miner's Meg work so flawlessley compared to Katie's Ruby and Gen's Ruby? When Rachel Miner showed up in season 5 as Meg, I really believed I was seeing Nicki Aycox's Meg when she was Meg 2.0\n\nGen and Katie's Rubys are just too different for me to believe that Katie's Ruby would be the Ruby we see with Gen's version.\n\nEven the actress who played Maid Ruby was more like Katie's than Gen.", "timestamp": 1763759608, "label": "1"}
{"original_topic": "supernatural", "comment": "Chronologically Sound? So I think most of you are aware that the show is scheduled to leave Netflix altogether in roughly a month.  \n\nI am running through the series, but I started about three months ago and am currently at the midway point of season 9.  What I want to ask you guys is, I won’t be able to finish the series in the time left mostly because I have a life and would need to watch multiple hours per day to finish it.  But I have heard about two episodes that not only sound super interesting, but also get great IMDb ratings that I’m really interested in watching:  “Scoobynatural“ and “Baby.”  Can I watch those right now, or at least very soon, and not be spoiling anything?  In other words, will I be able to watch it and enjoy/understand it without first burning through the series from where I am now?\n\nI appreciate the advice while avoiding spoilers from post season 9.   I’m also open to recs of other great later episodes that stand on their own, though given the time restraints I would need to be picky to weed out the lesser stuff from the great ones. \n\nAlso, one last thing; it sucks that Netflix is losing the show.  But there may be a tiny sliver of hope in that it’s been reported that Netflix is privately in communication with the owners of Warner Bros, which is up for sale.   They are interested in purchasing WB, but at this current stage they’re just feeling out their options versus other potential buyers to see if it’s feasible not only for themselves but for WB seller.  And of course, if they can purchase WB they would be outright getting the rights for Supernatural amongst their entire vast catalogue.  It probably won’t happen soon, but it could still happen.  Something to keep an eye on.\n\nI appreciate any comments about the two episodes referenced, cheers.  ✌️", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "Questing from the Occultum In season 15 when Jack visits the occultum, he speaks to the Serpent in the Garden of Eden. I'm confused. I thought the Serpent was Lucifer. If Lucifer is dead, how did Jack speak to the Serpent? Are the Serpent and Lucifer separate beings?", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "analysis on hypothetical \"irl hunters\" has anyone made an analysis on \"real\" hunters?\n\nI mean compare/contrast on how hunters would be in the real world", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "So season 6 brain thing Hello!\nJust a new little head cannon \n\nI think Sam was really harsh to Dean about having to be there, when he was trying to get back to him to save Ben and Lisa in the first episode because of him being soulless.\n\nIt never clicked in my head that he was so harsh and rude and un-Sam like because he was soulless\n\nAnd now I need someone to write a one shot about him, realising what he did when he got his soul back", "timestamp": 1763759608, "label": "0"}
{"original_topic": "supernatural", "comment": "Detroit Do people hate Detroit cuz that’s where the devil was??", "timestamp": 1763759609, "label": "0"}
{"original_topic": "supernatural", "comment": "tossed and turvy Maybe it's because I'm binging the show but has anyone noticed just how often somebody hand waves and sends our heroes flying around. I get they're doing action but tbh it really gets kinda tedious. It seems like it happens in every episode, often multiple times. just an opinion.", "timestamp": 1763759609, "label": "0"}
{"original_topic": "supernatural", "comment": "What was the point of this episode? How'd you react? https://preview.redd.it/bk5l2jm9li2g1.jpg?width=350&amp;format=pjpg&amp;auto=webp&amp;s=c1feb3c3b4035a513c95fb2c4f9acab13a8af556\n\nI still don't understand the meaning of this episode. This is season 5 episode 12 \"Swap Meat\" where this teenage boy basically used his abilities to switch bodies with Sam. I get this was supposed to be some unusual thing they haven't really experienced before, but the amount of times throughout this show when Sam's own body gets taken advantage of or violated is very unsettling. There's this episode, Azazel feeding demon blood to six-month old Sam, the woman in white basically force-kissing and abusing Sam in the pilot, Meg possessing Sam in S2E14, Ruby exploiting him with demon blood in season 4, the two hunters literally forcing demon blood down Sam's throat while physically restraining him in S5E3, that whole Becky plot in S7E8, and more. Why did the writers have Sam being constantly violated and taken advantage of and being the bigger punching bag and using them for laughs and humor? And yes, I know this show ended years ago, but still!!!!!", "timestamp": 1763759609, "label": "0"}
{"original_topic": "stranger_things", "comment": "I can't wait for Mike to be a leader again", "timestamp": 1763759609, "label": "0"}
{"original_topic": "stranger_things", "comment": "Why do you Steve fans want him to be second best? He's always second to Jonathan for Nancy's feelings. Be it second season or now if that's the case.", "timestamp": 1763759609, "label": "1"}
{"original_topic": "stranger_things", "comment": "I only watch season one and I’m going to jump straight into season 5💥 Promos have enticed me to watch again especially the “most visceral death” tip, surely there isn’t anything crucial I missed right?", "timestamp": 1763759609, "label": "1"}
{"original_topic": "stranger_things", "comment": "For y'all in NYC, I'm hosting a b*tchin' dinner + private cinema screening for the first two episodes! Not sure if posting the link to the event signup is allowed buuuuuuut here's the [Partiful](https://partiful.com/e/0jnXw1bd5XZ4NNwLYV6Z) for the event! \n\n  \nHere are the details:\n\n* Date &amp; time: Wednesday, Nov 26th 8pm\n* Location: Chelsea\n* Open spots 4-16 (may downscale to a smaller room)\n* Included: Dinner + screening of first two episodes\n* Price $150 per person.\n\nLet's get smackin'", "timestamp": 1763759609, "label": "1"}
{"original_topic": "stranger_things", "comment": "A Wrinkle in Time and Stranger Things Use the Same Dimensional Metaphor Lately I’ve been thinking about something interesting: in *Stranger Things*, the Upside Down is completely frozen on November 6, 1983—the exact day Will Byers disappeared. Time doesn’t move there. The whole world is “stuck.”\n\nAnd strangely enough, this reminds me of a moment in *A Wrinkle in Time* where Mrs. Whatsit explains how you can “wrinkle” space and time—literally folding a dimension so two faraway points suddenly touch. When a dimension gets bent or torn the wrong way, a slice of reality can get trapped outside the normal flow of time.\n\nIn *Wrinkle*, a misstep in higher-dimensional travel can freeze time, collapse a world, or trap someone in the wrong dimension.\n\nThat’s basically what happens in Hawkins.\n\nWhen Eleven touches the Demogorgon during the sensory-deprivation experiment in 1983, it doesn’t just open a gate—it tears the fabric of spacetime itself. The Upside Down becomes a *frozen moment* in Hawkins history, like a page ripped out of a book and stuck on repeat. A literal “wrinkle in time.”\n\nIt's a broken timeline, trapped in the moment the tear was made.\n\nThe metaphors line up:\n\n* *A Wrinkle in Time*: a dimensional fold that collapses time\n* *Stranger Things*: a dimensional tear that freezes time\n* The Upside Down: a world suspended in a single day\n\nThe more I think about it, the more it feels like the Upside Down isn’t just parallel—it’s stuck in November 6, 1983, because the original breach ripped a hole in the flow of time itself.\n\nKind of wild how two completely different stories end up saying the same thing about higher dimensions and broken timelines.", "timestamp": 1763759609, "label": "0"}
{"original_topic": "stranger_things", "comment": "What are some good episodes to watch, in place of a total rewatch? Preferably in chronological order.", "timestamp": 1763759610, "label": "0"}
{"original_topic": "stranger_things", "comment": "How can we get Netflix House to do a live premiere event for Stranger Things Season 5 premiere?!?! Netflix House just opened in Philadelphia! The Netflix inspired destination an eatery, game room, shop, immersive experiences and a THEATER! \n\nHow can we set up a popup event for Season 5 at the only Netflix live venue?!?\n\nWho else would like to go to an event like this?  I’m hoping through enough likes, shares and comments there will be enough interest to spark a popup event.\n\nIs anyone aware of any other unofficial live events for Season 5?", "timestamp": 1763759610, "label": "1"}
{"original_topic": "stranger_things", "comment": "has anyone been dissapointed after playing the new fortnite stranger things map? i was so excited about this collab but i’m so dissapointed with how much they did with it, first of all it’s only a blitz map, yet there’s an anyone BR map for the simpsons, the main problem tho is that it doesn’t actually look like hawkins, it’s just fortnite style buildings with vibes. just imagine if they actually made a full size stranger things map with realistic locations like the lab and star court mall, and they could’ve even included the tunnels for underground transportation, i can’t believe how badly epic games fumbled with this", "timestamp": 1763759610, "label": "0"}
{"original_topic": "stranger_things", "comment": "Handmade Byers living room with garlands out of cardboard from Stranger Things Netflix series Everything is completely handmade: cardboard, paper, acrylic paints, wooden sticks — no fancy materials, just patience and chaos 😅\n\nFull creation video (tutorial) https://youtu.be/VDO1rk3vqdA\n\nTotal budget ≈ $32.70 I spent 10 days making this.\n\nI’m Vlada, and I create cardboard miniatures — from Hogwarts and Harry Potter, to SpongeBob’s pineapple house, Patrick, and Squidward, to the Mystery Shack from Gravity Falls, The Simpsons, and many more iconic worlds!", "timestamp": 1763759610, "label": "0"}
{"original_topic": "stranger_things", "comment": "Unnecessary Plot Did anyone feel this was unnecessary plot or was underutilized character?", "timestamp": 1763759610, "label": "0"}
{"original_topic": "stranger_things", "comment": "The lost sister. Upon doing some research i now know that this is a somewhat singular episode.  But years ago I loved stranger things season 1 but can't remember why I never finished season 2. I remember now I stopped at season 2 ep 7 ( the lost sister) i found this episode so bad I lost interest in the whole show. Only to find out now it was just a single episode like this. \n\nI need to learn patience for sure but how silly putting an episode like this in it. I also guess lots of people have an issue with this episode.  The unfortunate thing is also that I didn't find season 2 that interesting. Should of stuck with it.", "timestamp": 1763759610, "label": "1"}
{"original_topic": "stranger_things", "comment": "Stephen King Connections New to Reddit and fairly new to stranger things. Have no one else to geek out with, so thought I’d give it a go here. You can make fun of me, but I’m not crazy familiar with King, only the most popular works like It. But a few fun things I wanted to check on, was the Creel house inspired by the Neibolt house? And is Vecna inspired by Pennywise, utilizing people’s greatest fears and trauma? The scene where Fred has people chanting “murderer” at him in the woods was very reminiscent of a Stephen King scene to me. Just curious what your favorite connections are, and please share any and all connections that you guys love! I’m sure my connections are super surface level, I’m not crazy versed in any of these things", "timestamp": 1763759610, "label": "1"}
{"original_topic": "stranger_things", "comment": "Lego Stranger Things Season 3 (Top Row) L to R: Jonathan, Nancy, Hopper, Joyce, Murray\n\n(Middle Row) L to R: Robin, Steve, Will, Mike, Lucas\n\n(Front Row) L to R: Erica, Dustin, Eleven, Max, Billy", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "JUST 5 MORE DAYS 🔥", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "Wills painting (interesting) Will painted a painting for Michael Wheeler in the hit TV-show Stranger Things Season 4 now streaming on the very popular (Glinda Approved) streaming service Netflix. I believe he painted rainbows showcasing his queer identity and his romantic feelings towards Mike. Eleven Eleven Eleven \n\n\n\nEleven", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "Inconsistencies between first shadow and the series I recently saw the play on Broadway and then decided to have a rewatch of the whole show. Here’s things I noticed with the play in mind while rewatching. \n\n- when Karen talks about getting married to Ted she says “he was older” (in a way that suggests a few years older) but in The First Shadow they’re the same age and got together in high school\n- Bob says Joyce didn’t even know who he was in High School… pretty sure she’d remember a kid she spent a very significant and absolutely terrifying night with hunting the Hawkins cat killer\n- there’s a patty working at Hawkins Lab (s2e1), singled out and mentioned by name \n- vecna’s clock chime can be heard in s2e4 when hopper finds the underground tunnels. \n-S4E9 Vecna says that the place eleven banished him to was “a new place”… but in the stage play we learn he has been to dimension X before. \n\nI think most of these are mistakes/coincidents seeing as they just didn’t have the Creel storyline mapped out early enough. But some of them could also be more meaningful? Keen to hear if anyone got a theory based on one of these.", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "\"King\" of the Upside Down? Hi everyone! I want to pose a question as i've seen people with different opinions argue about this topic and i'm curious.\nSPOILERS: i want to make sure i don't ruin the fun for anyone so if you haven't watched season 4 don't continue reading.\n\nWho would you think is the king/leader/thinking mind of the Upside Down?? Some say it's Vecna, others say that it's the Mindlflayer controlling Vecna.\nFor me it's clearly Vecna, we know that Henry entered a strange dimension when Eleven \"killed\" him, the Mindflayer was already there but it was Henry who shaped him (therefore connecting himself to the hive mind and gaining control of the creatures there) and the dimension into the world he desired. So it's ultimately Vecna the one who controls everything that happens in the Upside Down, including the actions of the Mindflayer in season 3.\nThe way I view it, the Mindlfayer is a tool for Vecna to use, not an independent creature (maybe it is but it's manipulated by Henry who knows).\n\nI'm interested in what the people that think it's the other way around have to say!", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "I really hope they drop the Nancy, Steve, Jonathan love triangle subplot and focus more on the their individual characters, giving them a way to move on. Nancy is a badass and the dilemma in the love triangle is holding her back. Same goes for Steve and Jonathan too.", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "Robin was kinda the MVP of early S4 I'm re-watching the show in preparation for the final season, and I realized how a lot of the big breaks in the first four episodes are at least partially attributable to Robin. In order, she:\n\n  \nHad the idea to look up all the Ricks' memberships at Family Video, which led the group to Eddie,\n\n  \nSuggested to Nancy to search through the Weekly Watcher, which had Victor's demon attack story,\n\n  \nConvinced Hatch to let her and Nancy talk to Victor, and\n\n  \nFigured out the music connection which saved Max's life.\n\n  \nJust something I noticed that I don't think I've seen brought up.", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "Real life STRANGER THINGS Facility EXPOSED | Anneke Lucas Incredibly - Stranger Things wasn’t just a work of fiction. It was based on a real life mind control facility, which Anneke Lucas was taken to as a child. Through the torture She developed psychic abilities and ability to put thoughts in other peoples heads! 🤯🤯🤯", "timestamp": 1763759611, "label": "1"}
{"original_topic": "stranger_things", "comment": "How often do you pet the intro music play? It’s a good tune. But I skip it most of the time. If I am binging I skip it every time, but if I’m just catching a few episodes here and there I might let it play.", "timestamp": 1763759612, "label": "0"}
{"original_topic": "stranger_things", "comment": "Scarier Vecna", "timestamp": 1763759612, "label": "0"}
{"original_topic": "stranger_things", "comment": "This dynamic is all I really wanna see from season 5. All over The net all I've seen is \"Byler\" this \"Mileven\" that.... \n\n\nBut what I'm most hopeful to see is these two finally interacting in a significant way. And to see if their relationship has at all grown.\n\n\nOf all the dynamics between characters missed opportunities etc The fact that Of everyone of the characters these two have barely shared any screentime or significant meaningful moments together is one I find the most baffling.\n\n\nEl risked her life to save Will Byers multiple times. Sensed him in the Upside Down. And did everything she could to reunite him with his friends and family. \n\n\nIn season 2 she states to Joyce she saw his suffering from the Mind flayers possession and closed the Gate saving his life and freeing him. \n\n\nAfter all that you would think these two would strike up some kind of friendship. Or meaningful dynamic. However the two barely interact. Even after Hopper's disappeareance and El's subsequent Adoption by Joyce. \n\n\nThe two go to school together, seem to get along for the most part but still no real sign of significant development in their Relationship. (Not even taking into account Will's feelings for Mike, as one could argue it's a contributing factor in Will seemingly being distant from El) \n\nWill does seem to feel bad for El experiencing bullying and offer to help fix her project. \n\n\nHowever afterwards there's some tension between them over Mike's visit. Again we aren't focusing on that.\n\n It's only after El is taken by Brenner that I think we begin to see Will really step up &amp; take some initiative to find her apart from Mike. Notably doing what he can to reassure Mike the whole time &amp; Straight up calling her Family and his sister even when \"Johnathan addresses her as \"Step sister \".\n\n\nIn these moments &amp; upon reuniting with El we finally see El and Will have a significant emotionally charged interaction. As they hug and Will tearfully asked if she was ok clearly relieved to see her. \n\n\nWill also is instrumental in motivating Mike to speak from his Heart to save her from Vecna. Another moment where Will stepped up for El. (Putting his own feelings aside for her safety in these moments may be his way of returning the favor )\n\nSo more than anything else next season I need to see this dynamic become more fleshed out. I think it's  long overdue that These two characters given everything they've been through together really feel like they've reached a point where they truly have become close friends who Have each other's backs. Will maybe even  thanking  El for Saving him before.\n\n\n\nI also think it's time for Will to step up this season and get angry if you know what I mean. The Mind flayer, Vecna, and The Upside-down has ruined his entire life and hurt everyone he cares about. It's time he was the one to fight back and say \"Enough\"! \n\n\nBut what do you guys think? Do you guys wanna see Will and El become closer in season 5?", "timestamp": 1763759612, "label": "1"}
{"original_topic": "stranger_things", "comment": "Anyone see these popping up anywhere? Upstate NY for context.", "timestamp": 1763759612, "label": "1"}
{"original_topic": "stranger_things", "comment": "Why do people hate the Russian prison plot of season 4? I’ve been seeing a lot of hate for it online recently and I don’t understand why. Personally, it’s my favorite plot of the season. I enjoy the other stuff too, but I’m always waiting in the back of my mind to go back to Hopper, Joyce and Murray.", "timestamp": 1763759612, "label": "1"}
